doc.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-03-11 Wed 16:26 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="YFZX-WZX" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#nn.h---neural-network-library-explained">1. nn.h - Neural Network Library Explained</a>
<ul>
<li><a href="#table-of-contents">1.1. Table of Contents</a></li>
<li><a href="#overview">1.2. Overview</a>
<ul>
<li><a href="#key-features">1.2.1. Key Features</a></li>
</ul>
</li>
<li><a href="#interactive-learning-guide">1.3. Interactive Learning Guide</a>
<ul>
<li><a href="#learning-path">1.3.1. Learning Path</a></li>
<li><a href="#step-1-understanding-the-matrix">1.3.2. Step 1: Understanding the Matrix</a></li>
<li><a href="#step-2-matrix-access-macro">1.3.3. Step 2: Matrix Access Macro</a></li>
<li><a href="#step-3-matrix-operations">1.3.4. Step 3: Matrix Operations</a></li>
<li><a href="#step-4-activation-functions">1.3.5. Step 4: Activation Functions</a></li>
<li><a href="#step-5-neural-network">1.3.6. Step 5: Neural Network</a></li>
<li><a href="#step-6-training---the-cost-function">1.3.7. Step 6: Training - The Cost Function</a></li>
<li><a href="#step-7-backpropagation">1.3.8. Step 7: Backpropagation</a></li>
<li><a href="#step-8-putting-it-all-together">1.3.9. Step 8: Putting It All Together</a></li>
<li><a href="#congratulations">1.3.10. 🎓 Congratulations!</a></li>
<li><a href="#quick-reference">1.3.11. 📚 Quick Reference</a></li>
</ul>
</li>
<li><a href="#header-guards">1.4. Header Guards</a>
<ul>
<li><a href="#what-are-header-guards">1.4.1. What are header guards?</a></li>
<li><a href="#how-they-work">1.4.2. How they work:</a></li>
</ul>
</li>
<li><a href="#includes-and-dependencies">1.5. Includes and Dependencies</a></li>
<li><a href="#configurable-macros">1.6. Configurable Macros</a>
<ul>
<li><a href="#memory-allocation-customization">1.6.1. Memory Allocation Customization</a></li>
<li><a href="#why-this-is-useful">1.6.2. Why this is useful:</a></li>
<li><a href="#assertion-customization">1.6.3. Assertion Customization</a></li>
<li><a href="#array-length-macro">1.6.4. Array Length Macro</a></li>
</ul>
</li>
<li><a href="#data-structures">1.7. Data Structures</a>
<ul>
<li><a href="#gym_batch---batch-processing-state">1.7.1. 1. Gym<sub>Batch</sub> - Batch Processing State</a></li>
<li><a href="#mat---matrix-structure">1.7.2. 2. Mat - Matrix Structure</a></li>
<li><a href="#matrix-access-macro">1.7.3. Matrix Access Macro</a></li>
</ul>
</li>
<li><a href="#matrix-operations">1.8. Matrix Operations</a>
<ul>
<li><a href="#mat_alloc---create-a-matrix">1.8.1. 1. mat<sub>alloc</sub>() - Create a Matrix</a></li>
<li><a href="#what-it-does">1.8.2. What it does:</a></li>
<li><a href="#mat_fill---fill-matrix-with-value">1.8.3. 2. mat<sub>fill</sub>() - Fill Matrix with Value</a></li>
<li><a href="#mat_dot---matrix-multiplication">1.8.4. 3. mat<sub>dot</sub>() - Matrix Multiplication</a></li>
<li><a href="#understanding-matrix-multiplication">1.8.5. Understanding Matrix Multiplication:</a></li>
<li><a href="#mat_row---create-a-row-view">1.8.6. 4. mat<sub>row</sub>() - Create a Row View</a></li>
<li><a href="#mat_sig---apply-sigmoid-activation">1.8.7. 5. mat<sub>sig</sub>() - Apply Sigmoid Activation</a></li>
<li><a href="#the-sigmoid-function-1">1.8.8. The Sigmoid Function:</a></li>
<li><a href="#mat_sum---element-wise-addition">1.8.9. 6. mat<sub>sum</sub>() - Element-wise Addition</a></li>
<li><a href="#mat_copy---copy-matrix-data">1.8.10. 7. mat<sub>copy</sub>() - Copy Matrix Data</a></li>
<li><a href="#mat_rand---random-initialization">1.8.11. 8. mat<sub>rand</sub>() - Random Initialization</a></li>
<li><a href="#mat_save-and-mat_load---persistence">1.8.12. 9. mat<sub>save</sub>() and mat<sub>load</sub>() - Persistence</a></li>
<li><a href="#mat_print---debug-output">1.8.13. 10. mat<sub>print</sub>() - Debug Output</a></li>
<li><a href="#mat_shuffle_rows---random-row-shuffling">1.8.14. 11. mat<sub>shuffle</sub><sub>rows</sub>() - Random Row Shuffling</a></li>
</ul>
</li>
<li><a href="#neural-network-structure">1.9. Neural Network Structure</a>
<ul>
<li><a href="#the-nn-structure">1.9.1. The NN Structure</a></li>
<li><a href="#understanding-the-structure">1.9.2. Understanding the Structure:</a></li>
<li><a href="#helper-macros">1.9.3. Helper Macros</a></li>
<li><a href="#nn_alloc---create-network">1.9.4. nn<sub>alloc</sub>() - Create Network</a></li>
<li><a href="#how-it-works">1.9.5. How it works:</a></li>
<li><a href="#nn_forward---forward-pass">1.9.6. nn<sub>forward</sub>() - Forward Pass</a></li>
<li><a href="#the-forward-pass">1.9.7. The Forward Pass:</a></li>
<li><a href="#nn_cost---calculate-loss">1.9.8. nn<sub>cost</sub>() - Calculate Loss</a></li>
<li><a href="#understanding-cost-function">1.9.9. Understanding Cost Function:</a></li>
</ul>
</li>
<li><a href="#training-algorithm">1.10. Training Algorithm</a>
<ul>
<li><a href="#nn_backprop---backpropagation">1.10.1. nn<sub>backprop</sub>() - Backpropagation</a></li>
<li><a href="#understanding-backpropagation">1.10.2. Understanding Backpropagation:</a></li>
<li><a href="#nn_learn---update-weights">1.10.3. nn<sub>learn</sub>() - Update Weights</a></li>
<li><a href="#gradient-descent">1.10.4. Gradient Descent:</a></li>
<li><a href="#nn_rand---random-initialization">1.10.5. nn<sub>rand</sub>() - Random Initialization</a></li>
</ul>
</li>
<li><a href="#visualization-system-gym">1.11. Visualization System (Gym)</a>
<ul>
<li><a href="#plot-structure">1.11.1. Plot Structure</a></li>
<li><a href="#dynamic-array-macro">1.11.2. Dynamic Array Macro</a></li>
<li><a href="#gym_render_nn---visualize-network">1.11.3. gym<sub>render</sub><sub>nn</sub>() - Visualize Network</a></li>
<li><a href="#gym_plot---draw-cost-graph">1.11.4. gym<sub>plot</sub>() - Draw Cost Graph</a></li>
<li><a href="#gym_process_batch---batch-training">1.11.5. gym<sub>process</sub><sub>batch</sub>() - Batch Training</a></li>
</ul>
</li>
<li><a href="#complete-usage-example">1.12. Complete Usage Example</a></li>
<li><a href="#learning-checklist">1.13. Learning Checklist</a>
<ul>
<li><a href="#foundation-skills">1.13.1. 🟢 Foundation Skills</a></li>
<li><a href="#matrix-operations-1">1.13.2. 🟡 Matrix Operations</a></li>
<li><a href="#neural-network">1.13.3. 🔴 Neural Network</a></li>
<li><a href="#complete-project">1.13.4. 🏆 Complete Project</a></li>
</ul>
</li>
<li><a href="#common-pitfalls-debugging-tips">1.14. Common Pitfalls &amp; Debugging Tips</a>
<ul>
<li><a href="#common-mistakes-beginners-make">1.14.1. ⚠️ Common Mistakes Beginners Make</a></li>
<li><a href="#debugging-techniques">1.14.2. 🔍 Debugging Techniques</a></li>
</ul>
</li>
<li><a href="#key-takeaways">1.15. Key Takeaways</a></li>
<li><a href="#practice-problems">1.16. Practice Problems</a>
<ul>
<li><a href="#beginner-problems">1.16.1. 📝 Beginner Problems</a></li>
<li><a href="#intermediate-problems">1.16.2. 📝 Intermediate Problems</a></li>
<li><a href="#advanced-problems">1.16.3. 📝 Advanced Problems</a></li>
</ul>
</li>
<li><a href="#further-learning">1.17. Further Learning</a></li>
<li><a href="#summary-table">1.18. Summary Table</a></li>
<li><a href="#references">1.19. References</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-nn.h---neural-network-library-explained" class="outline-2">
<h2 id="nn.h---neural-network-library-explained"><span class="section-number-2">1.</span> nn.h - Neural Network Library Explained</h2>
<div class="outline-text-2" id="text-nn.h---neural-network-library-explained">
</div>
<div id="outline-container-table-of-contents" class="outline-3">
<h3 id="table-of-contents"><span class="section-number-3">1.1.</span> Table of Contents</h3>
<div class="outline-text-3" id="text-table-of-contents">
<ol class="org-ol">
<li><a href="#overview">Overview</a></li>
<li><a href="#interactive-learning-guide">Interactive Learning Guide</a> ⭐ <b>START
HERE</b></li>
<li><a href="#header-guards">Header Guards</a></li>
<li><a href="#includes-and-dependencies">Includes and Dependencies</a></li>
<li><a href="#configurable-macros">Configurable Macros</a></li>
<li><a href="#data-structures">Data Structures</a></li>
<li><a href="#matrix-operations">Matrix Operations</a></li>
<li><a href="#neural-network-structure">Neural Network Structure</a></li>
<li><a href="#training-algorithm">Training Algorithm</a></li>
<li><a href="#visualization-system-gym">Visualization System (Gym)</a></li>
</ol>

<hr />
</div>
</div>

<div id="outline-container-overview" class="outline-3">
<h3 id="overview"><span class="section-number-3">1.2.</span> Overview</h3>
<div class="outline-text-3" id="text-overview">
<p>
<code>nn.h</code> is a <b>header-only C library</b> that implements a simple feedforward
neural network with backpropagation training. It's designed to be
educational and easy to understand.
</p>
</div>

<div id="outline-container-key-features" class="outline-4">
<h4 id="key-features"><span class="section-number-4">1.2.1.</span> Key Features</h4>
<div class="outline-text-4" id="text-key-features">
<ul class="org-ul">
<li><b>Matrix operations</b> for mathematical computations</li>
<li><b>Multi-layer perceptron</b> neural network</li>
<li><b>Backpropagation</b> training algorithm</li>
<li><b>Optional visualization</b> using Raylib library</li>
</ul>

<hr />
</div>
</div>
</div>

<div id="outline-container-interactive-learning-guide" class="outline-3">
<h3 id="interactive-learning-guide"><span class="section-number-3">1.3.</span> Interactive Learning Guide</h3>
<div class="outline-text-3" id="text-interactive-learning-guide">
<blockquote>
<p>
🎯 <b>This section is designed to help you rewrite nn.h from scratch!</b>
Follow these guided exercises to deeply understand how the library
works.
</p>
</blockquote>
</div>

<div id="outline-container-learning-path" class="outline-4">
<h4 id="learning-path"><span class="section-number-4">1.3.1.</span> Learning Path</h4>
<div class="outline-text-4" id="text-learning-path">
<p>
Choose your path based on your experience level:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Level</th>
<th scope="col" class="org-left">Description</th>
<th scope="col" class="org-left">Where to Start</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">🟢 <b>Beginner</b></td>
<td class="org-left">New to C and neural networks? Start here</td>
<td class="org-left"><a href="#step-1-understanding-the-matrix">Step 1: Understanding the Matrix</a></td>
</tr>

<tr>
<td class="org-left">🟡 <b>Intermediate</b></td>
<td class="org-left">Know C but new to NNs?</td>
<td class="org-left"><a href="#step-3-matrix-operations">Step 3: Matrix Operations</a></td>
</tr>

<tr>
<td class="org-left">🔴 <b>Advanced</b></td>
<td class="org-left">Understand the concepts, want practice?</td>
<td class="org-left"><a href="#step-5-neural-network">Step 5: Neural Network</a></td>
</tr>
</tbody>
</table>

<hr />
</div>
</div>

<div id="outline-container-step-1-understanding-the-matrix" class="outline-4">
<h4 id="step-1-understanding-the-matrix"><span class="section-number-4">1.3.2.</span> Step 1: Understanding the Matrix</h4>
<div class="outline-text-4" id="text-step-1-understanding-the-matrix">
</div>
<ol class="org-ol">
<li><a id="think-about-it"></a>🤔 Think About It<br />
<div class="outline-text-5" id="text-think-about-it">
<p>
Before writing any code, answer these questions:
</p>

<p>
<b>Q1: What is a matrix?</b>
</p>

<div class="html" id="org712bd73">
<p>
&lt;details&gt;
</p>

</div>

<div class="html" id="org044484c">
<p>
&lt;summary&gt;
</p>

</div>

<p>
Click to see answer
</p>

<div class="html" id="org41f8400">
<p>
&lt;/summary&gt;
</p>

</div>

<p>
A matrix is a 2-dimensional grid of numbers. In C, we represent it as: -
Number of rows - Number of columns - A pointer to the actual data
</p>

<div class="html" id="org526b07f">
<p>
&lt;/details&gt;
</p>

</div>

<p>
<b>Q2: How do we store a 2D array in C memory?</b>
</p>

<div class="html" id="orge0cb08e">
<p>
&lt;details&gt;
</p>

</div>

<div class="html" id="org863caf4">
<p>
&lt;summary&gt;
</p>

</div>

<p>
Click to see answer
</p>

<div class="html" id="org448584d">
<p>
&lt;/summary&gt;
</p>

</div>

<p>
We store it in <b>row-major order</b> - all elements of row 0 first, then row
1, etc.
</p>

<p>
Example for a 2×3 matrix:
</p>

<pre class="example" id="org6168ec5">
[1, 2, 3]     Memory: [1, 2, 3, 4, 5, 6]
[4, 5, 6]
</pre>

<div class="html" id="org3932088">
<p>
&lt;/details&gt;
</p>

</div>

<p>
<b>Q3: How do we access element at row i, column j?</b>
</p>

<div class="html" id="orgf23f598">
<p>
&lt;details&gt;
</p>

</div>

<div class="html" id="org7998032">
<p>
&lt;summary&gt;
</p>

</div>

<p>
Click to see answer
</p>

<div class="html" id="orgc560215">
<p>
&lt;/summary&gt;
</p>

</div>

<pre class="example" id="orgc0ec5d3">
index = i * columns + j
</pre>

<p>
For a 3×4 matrix, element [1][2] is at index:
</p>

<pre class="example" id="org998c1c7">
index = 1 * 4 + 2 = 6
</pre>

<div class="html" id="orgcbd3ec6">
<p>
&lt;/details&gt;
</p>

</div>
</div>
</li>
