doc.org
**** ✍️ Your Turn: Write the Matrix Structure

Now try to write the structure yourself before looking at the answer:

#+BEGIN_SRC c
// TODO: Write the Mat structure
// It should have:
// - rows (number of rows)
// - cols (number of columns)
// - stride (why do we need this?)
// - es (pointer to elements)

typedef struct {
    // Your code here
} Mat;
#+END_SRC

*Answer:*

#+BEGIN_SRC c
typedef struct {
    size_t rows;    // Number of rows
    size_t cols;    // Number of columns
    size_t stride;  // Elements per row in memory
    float *es;      // Pointer to matrix elements
} Mat;
#+END_SRC

**** 🤔 What is =stride= and why do we need it?

Stride is the number of elements to skip to get to the next row. For most matrices, =stride == cols=.

*But stride enables a powerful feature:* row views that share memory!

#+BEGIN_SRC c
// Parent matrix: 3×4
Mat parent = {
    .rows = 3,
    .cols = 4,
    .stride = 4,
    .es = [1,2,3,4, 5,6,7,8, 9,10,11,12]
};

// Row view: 1×4 (shares memory with parent!)
Mat row = {
    .rows = 1,
    .cols = 4,
    .stride = 4,  // Same as parent!
    .es = &parent.es[4]  // Points to row 1
};

// Modifying row modifies parent!
MAT_AT(row, 0, 0) = 99;  // Changes parent[1][0] to 99
#+END_SRC

This avoids expensive memory copies!

-----

*** Step 2: Matrix Access Macro

**** 🤔 Think About It

Given what you learned about stride, how do we access element [i][j]?

*Hint:* Remember the memory is laid out as rows, and stride tells us how far apart rows are.

*Answer:*

#+BEGIN_SRC c
#define MAT_AT(m, i, j) (m).es[(i) * (m).stride + (j)]
#+END_SRC

*Breakdown:*
- =(i) * (m).stride= - skip i rows
- =+ (j)= - move j columns into the current row

**** ✍️ Practice: Trace Through an Example

#+BEGIN_SRC c
Mat m = {
    .rows = 2,
    .cols = 3,
    .stride = 3,
    .es = {1, 2, 3, 4, 5, 6}
};
#+END_SRC

*What is MAT_AT(m, 1, 2)?*

#+BEGIN_EXAMPLE
MAT_AT(m, 1, 2) = m.es[1 * 3 + 2] = m.es[5] = 6
#+END_EXAMPLE

*What if stride = 4 (larger than cols)?*

#+BEGIN_EXAMPLE
MAT_AT(m, 1, 2) = m.es[1 * 4 + 2] = m.es[6]

// The extra element in stride is "padding" or unused
#+END_EXAMPLE

-----

*** Step 3: Matrix Operations

**** ✍️ Exercise: Implement mat_alloc()

Before looking at the answer, try to write =mat_alloc()=:

#+BEGIN_SRC c
// Allocate a matrix with given dimensions
Mat mat_alloc(size_t rows, size_t cols)
{
    Mat m;
    // Your code here:
    // 1. Set the dimensions
    // 2. Allocate memory
    // 3. Return the matrix

    return m;
}
#+END_SRC

*Answer:*

#+BEGIN_SRC c
Mat mat_alloc(size_t rows, size_t cols)
{
    Mat m;
    m.rows = rows;
    m.cols = cols;
    m.stride = cols;  // For new matrices, stride = cols
    m.es = NN_MALLOC(sizeof(*m.es) * rows * cols);
    NN_ASSERT(m.es != NULL && "Memory allocation failed");
    return m;
}
#+END_SRC

**** ✍️ Exercise: Implement mat_fill()

Try to write a function that fills every element with a value:

#+BEGIN_SRC c
void mat_fill(Mat m, float x)
{
    // Your code here: iterate through all elements
}
#+END_SRC

*Answer:*

#+BEGIN_SRC c
void mat_fill(Mat m, float x)
{
    for (size_t i = 0; i < m.rows; ++i) {
        for (size_t j = 0; j < m.cols; ++j) {
            MAT_AT(m, i, j) = x;
        }
    }
}
#+END_SRC

