doc.html

<li><a id="your-turn-write-the-matrix-structure"></a>✍️ Your Turn: Write the Matrix Structure<br />
<div class="outline-text-5" id="text-your-turn-write-the-matrix-structure">
<p>
Now try to write the structure yourself before looking at the answer:
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">TODO: Write the Mat structure
</span><span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">It should have:
</span><span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">- rows (number of rows)
</span><span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">- cols (number of columns)
</span><span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">- stride (why do we need this?)
</span><span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">- es (pointer to elements)
</span>
<span style="color: #ffdd33; font-weight: bold;">typedef</span> <span style="color: #ffdd33; font-weight: bold;">struct</span> {
    <span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">Your code here
</span>} <span style="color: #95a99f;">Mat</span>;
</pre>
</div>

<div class="html" id="org6ea596a">
<p>
&lt;details&gt;
</p>

</div>

<div class="html" id="org3c7cdd6">
<p>
&lt;summary&gt;
</p>

</div>

<p>
Click to see the answer
</p>

<div class="html" id="org2cd6b6f">
<p>
&lt;/summary&gt;
</p>

</div>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #ffdd33; font-weight: bold;">typedef</span> <span style="color: #ffdd33; font-weight: bold;">struct</span> {
    <span style="color: #95a99f;">size_t</span> <span style="color: #f4f4ff;">rows</span>;    <span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">Number of rows
</span>    <span style="color: #95a99f;">size_t</span> <span style="color: #f4f4ff;">cols</span>;    <span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">Number of columns
</span>    <span style="color: #95a99f;">size_t</span> <span style="color: #f4f4ff;">stride</span>;  <span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">Elements per row in memory
</span>    <span style="color: #95a99f;">float</span> *<span style="color: #f4f4ff;">es</span>;      <span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">Pointer to matrix elements
</span>} <span style="color: #95a99f;">Mat</span>;
</pre>
</div>

<div class="html" id="org03d95ee">
<p>
&lt;/details&gt;
</p>

</div>
</div>
</li>

<li><a id="what-is-stride-and-why-do-we-need-it"></a>🤔 What is <code>stride</code> and why do we need it?<br />
<div class="outline-text-5" id="text-what-is-stride-and-why-do-we-need-it">
<div class="html" id="orgf2d98c8">
<p>
&lt;details&gt;
</p>

</div>

<div class="html" id="org75d007b">
<p>
&lt;summary&gt;
</p>

</div>

<p>
Click for explanation
</p>

<div class="html" id="org2d23e29">
<p>
&lt;/summary&gt;
</p>

</div>

<p>
Stride is the number of elements to skip to get to the next row. For
most matrices, <code>stride =</code> cols=.
</p>

<p>
<b>But stride enables a powerful feature:</b> row views that share memory!
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">Parent matrix: 3&#215;4
</span><span style="color: #95a99f;">Mat</span> <span style="color: #f4f4ff;">parent</span> = {
    .rows = 3,
    .cols = 4,
    .stride = 4,
    .es = [1,2,3,4, 5,6,7,8, 9,10,11,12]
};

<span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">Row view: 1&#215;4 (shares memory with parent!)
</span><span style="color: #95a99f;">Mat</span> <span style="color: #f4f4ff;">row</span> = {
    .rows = 1,
    .cols = 4,
    .stride = 4,  <span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">Same as parent!
</span>    .es = &amp;parent.es[4]  <span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">Points to row 1
</span>};

<span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">Modifying row modifies parent!
</span><span style="color: #96a6c8;">MAT_AT</span>(row, 0, 0) = 99;  <span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">Changes parent[1][0] to 99</span>
</pre>
</div>

<p>
This avoids expensive memory copies!
</p>

<div class="html" id="orge0a2663">
<p>
&lt;/details&gt;
</p>

</div>

<hr />
</div>
</li>
</ol>
</div>

<div id="outline-container-step-2-matrix-access-macro" class="outline-4">
<h4 id="step-2-matrix-access-macro"><span class="section-number-4">1.3.3.</span> Step 2: Matrix Access Macro</h4>
<div class="outline-text-4" id="text-step-2-matrix-access-macro">
</div>
<ol class="org-ol">
<li><a id="think-about-it-1"></a>🤔 Think About It<br />
<div class="outline-text-5" id="text-think-about-it-1">
<p>
Given what you learned about stride, how do we access element [i][j]?
</p>

<p>
<b>Hint:</b> Remember the memory is laid out as rows, and stride tells us how
far apart rows are.
</p>

<div class="html" id="orgcada52c">
<p>
&lt;details&gt;
</p>

</div>

<div class="html" id="org27a26f4">
<p>
&lt;summary&gt;
</p>

</div>

<p>
Click to see answer
</p>

<div class="html" id="orgde9ac3f">
<p>
&lt;/summary&gt;
</p>

</div>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #95a99f;">#define</span> <span style="color: #96a6c8;">MAT_AT</span>(<span style="color: #f4f4ff;">m</span>, <span style="color: #f4f4ff;">i</span>, <span style="color: #f4f4ff;">j</span>) (m).es[(i) * (m).stride + (j)]
</pre>
</div>

<p>
<b>Breakdown:</b> - <code>(i) * (m).stride</code> - skip i rows - <code>+ (j)</code> - move j
columns into the current row
</p>

<div class="html" id="org60ebba4">
<p>
&lt;/details&gt;
</p>

</div>
</div>
</li>

<li><a id="practice-trace-through-an-example"></a>✍️ Practice: Trace Through an Example<br />
<div class="outline-text-5" id="text-practice-trace-through-an-example">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #95a99f;">Mat</span> <span style="color: #f4f4ff;">m</span> = {
    .rows = 2,
    .cols = 3,
    .stride = 3,
    .es = {1, 2, 3, 4, 5, 6}
};
</pre>
</div>

<p>
<b>What is MAT<sub>AT</sub>(m, 1, 2)?</b>
</p>

<div class="html" id="org0707116">
<p>
&lt;details&gt;
</p>

</div>

<div class="html" id="orgb03d39e">
<p>
&lt;summary&gt;
</p>

</div>

<p>
Click to see answer
</p>

<div class="html" id="org000d090">
<p>
&lt;/summary&gt;
</p>

</div>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #96a6c8;">MAT_AT</span>(m, 1, 2) = m.es[1 * 3 + 2] = m.es[5] = 6
</pre>
</div>

<div class="html" id="orgcb5f9ad">
<p>
&lt;/details&gt;
</p>

</div>

<p>
<b>What if stride = 4 (larger than cols)?</b>
</p>

<div class="html" id="orgf5bc66a">
<p>
&lt;details&gt;
</p>

</div>

<div class="html" id="org35d18b9">
<p>
&lt;summary&gt;
</p>

</div>

<p>
Click to see answer
</p>

<div class="html" id="org391d004">
<p>
&lt;/summary&gt;
</p>

</div>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #96a6c8;">MAT_AT</span>(m, 1, 2) = m.es[1 * 4 + 2] = m.es[6]

<span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">The extra element in stride is "padding" or unused</span>
</pre>
</div>

<div class="html" id="org90263cf">
<p>
&lt;/details&gt;
</p>

</div>

<hr />
</div>
</li>
</ol>
</div>

<div id="outline-container-step-3-matrix-operations" class="outline-4">
<h4 id="step-3-matrix-operations"><span class="section-number-4">1.3.4.</span> Step 3: Matrix Operations</h4>
<div class="outline-text-4" id="text-step-3-matrix-operations">
</div>
<ol class="org-ol">
<li><a id="exercise-implement-mat_alloc"></a>✍️ Exercise: Implement mat<sub>alloc</sub>()<br />
<div class="outline-text-5" id="text-exercise-implement-mat_alloc">
<p>
Before looking at the answer, try to write <code>mat_alloc()</code>:
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">Allocate a matrix with given dimensions
</span><span style="color: #95a99f;">Mat</span> <span style="color: #96a6c8;">mat_alloc</span>(<span style="color: #95a99f;">size_t</span> <span style="color: #f4f4ff;">rows</span>, <span style="color: #95a99f;">size_t</span> <span style="color: #f4f4ff;">cols</span>)
{
    <span style="color: #95a99f;">Mat</span> <span style="color: #f4f4ff;">m</span>;
    <span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">Your code here:
</span>    <span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">1. Set the dimensions
</span>    <span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">2. Allocate memory
</span>    <span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">3. Return the matrix
</span>
    <span style="color: #ffdd33; font-weight: bold;">return</span> m;
}
</pre>
</div>

<div class="html" id="org7aecb53">
<p>
&lt;details&gt;
</p>

</div>

<div class="html" id="orgce8d2c7">
<p>
&lt;summary&gt;
</p>

</div>

<p>
Click to see the answer
</p>

<div class="html" id="org6c8c118">
<p>
&lt;/summary&gt;
</p>

</div>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #95a99f;">Mat</span> <span style="color: #96a6c8;">mat_alloc</span>(<span style="color: #95a99f;">size_t</span> <span style="color: #f4f4ff;">rows</span>, <span style="color: #95a99f;">size_t</span> <span style="color: #f4f4ff;">cols</span>)
{
    <span style="color: #95a99f;">Mat</span> <span style="color: #f4f4ff;">m</span>;
    m.rows = rows;
    m.cols = cols;
    m.stride = cols;  <span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">For new matrices, stride = cols
</span>    m.es = NN_MALLOC(<span style="color: #ffdd33; font-weight: bold;">sizeof</span>(*m.es) * rows * cols);
    NN_ASSERT(m.es != <span style="color: #95a99f;">NULL</span> &amp;&amp; <span style="color: #73c936;">"Memory allocation failed"</span>);
    <span style="color: #ffdd33; font-weight: bold;">return</span> m;
}
</pre>
</div>

<div class="html" id="orgc2cd003">
<p>
&lt;/details&gt;
</p>

</div>
</div>
</li>

<li><a id="exercise-implement-mat_fill"></a>✍️ Exercise: Implement mat<sub>fill</sub>()<br />
<div class="outline-text-5" id="text-exercise-implement-mat_fill">
<p>
Try to write a function that fills every element with a value:
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #95a99f;">void</span> <span style="color: #96a6c8;">mat_fill</span>(<span style="color: #95a99f;">Mat</span> <span style="color: #f4f4ff;">m</span>, <span style="color: #95a99f;">float</span> <span style="color: #f4f4ff;">x</span>)
{
    <span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">Your code here: iterate through all elements
</span>}
</pre>
</div>

<div class="html" id="orgecec17d">
<p>
&lt;details&gt;
</p>

</div>

<div class="html" id="orge966295">
<p>
&lt;summary&gt;
</p>

</div>

<p>
Click to see the answer
</p>

<div class="html" id="orgcd31960">
<p>
&lt;/summary&gt;
</p>

</div>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #95a99f;">void</span> <span style="color: #96a6c8;">mat_fill</span>(<span style="color: #95a99f;">Mat</span> <span style="color: #f4f4ff;">m</span>, <span style="color: #95a99f;">float</span> <span style="color: #f4f4ff;">x</span>)
{
    <span style="color: #ffdd33; font-weight: bold;">for</span> (<span style="color: #95a99f;">size_t</span> <span style="color: #f4f4ff;">i</span> = 0; i &lt; m.rows; ++i) {
        <span style="color: #ffdd33; font-weight: bold;">for</span> (<span style="color: #95a99f;">size_t</span> <span style="color: #f4f4ff;">j</span> = 0; j &lt; m.cols; ++j) {
            MAT_AT(m, i, j) = x;
        }
    }
}
</pre>
</div>

<div class="html" id="org598c27f">
<p>
&lt;/details&gt;
</p>

</div>
</div>
</li>
