doc.org
**** 🎯 Challenge: Matrix Multiplication

This is the hardest but most important operation!

*Understanding the Problem:*

If A is 2×3 and B is 3×4, what size is C = A × B?

*C is 2×4*

*Rule:* (m×n) × (n×p) = (m×p)

The inner dimensions must match!

*How to compute C[i][j]?*

#+BEGIN_EXAMPLE
C[i][j] = Σ(A[i][k] * B[k][j]) for k = 0 to n-1
#+END_EXAMPLE

This is the dot product of row i of A and column j of B.

*Example:*
#+BEGIN_EXAMPLE
A = [1 2]    B = [5 6]
    [3 4]        [7 8]

C[0][0] = 1*5 + 2*7 = 19
C[0][1] = 1*6 + 2*8 = 22
C[1][0] = 3*5 + 4*7 = 43
C[1][1] = 3*6 + 4*8 = 50
#+END_EXAMPLE

**** ✍️ Exercise: Implement mat_dot()

#+BEGIN_SRC c
void mat_dot(Mat dst, Mat a, Mat b)
{
    // TODO: Implement matrix multiplication
    // Remember to:
    // 1. Assert dimensions are compatible
    // 2. Initialize dst to zero
    // 3. Compute each element
}
#+END_SRC

*Answer:*

#+BEGIN_SRC c
void mat_dot(Mat dst, Mat a, Mat b)
{
    NN_ASSERT(a.cols == b.rows);
    NN_ASSERT(dst.rows == a.rows);
    NN_ASSERT(dst.cols == b.cols);

    size_t n = a.cols;

    for (size_t i = 0; i < dst.rows; ++i) {
        for (size_t j = 0; j < dst.cols; ++j) {
            MAT_AT(dst, i, j) = 0;  // Initialize
            for (size_t k = 0; k < n; ++k) {
                MAT_AT(dst, i, j) += MAT_AT(a, i, k) * MAT_AT(b, k, j);
            }
        }
    }
}
#+END_SRC

-----

*** Step 4: Activation Functions

**** 🤔 What is an activation function?

Activation functions introduce non-linearity into neural networks. Without them, a neural network is just matrix multiplication, which can only learn linear relationships.

*Common activation functions:*
- *Sigmoid:* Squashes to (0, 1) - good for probabilities
- *ReLU:* max(0, x) - simple and fast
- *Tanh:* Squashes to (-1, 1) - zero-centered

**** The Sigmoid Function

#+BEGIN_EXAMPLE
σ(x) = 1 / (1 + e^(-x))
#+END_EXAMPLE

*Properties:*
- Always outputs between 0 and 1
- Smooth and differentiable
- Derivative is easy: σ'(x) = σ(x) × (1 - σ(x))

**** ✍️ Exercise: Implement sigmoidf()

#+BEGIN_SRC c
float sigmoidf(float x)
{
    // TODO: Implement sigmoid
    // Hint: Use expf() from math.h
}
#+END_SRC

*Answer:*

#+BEGIN_SRC c
float sigmoidf(float x)
{
    return 1.0f / (1.0f + expf(-x));
}
#+END_SRC

**** ✍️ Exercise: Apply sigmoid to a matrix

#+BEGIN_SRC c
void mat_sig(Mat m)
{
    // TODO: Apply sigmoid to every element
}
#+END_SRC

*Answer:*

#+BEGIN_SRC c
void mat_sig(Mat m)
{
    for (size_t i = 0; i < m.rows; ++i) {
        for (size_t j = 0; j < m.cols; ++j) {
            MAT_AT(m, i, j) = sigmoidf(MAT_AT(m, i, j));
        }
    }
}
#+END_SRC

-----

*** Step 5: Neural Network

**** 🤔 What is a neural network?

A neural network is composed of layers of neurons:
- *Input layer:* Receives the raw data
- *Hidden layers:* Process the data (can have multiple)
- *Output layer:* Produces the final prediction

Each connection between neurons has:
- *Weight (W):* How strong the connection is
- *Bias (b):* An offset/threshold

*Forward pass:*
#+BEGIN_EXAMPLE
output = σ(input × W + b)
#+END_EXAMPLE

**** Understanding the NN Structure

For architecture =[2, 3, 1]=:

#+BEGIN_EXAMPLE
Layer 0 (Input): 2 neurons
Layer 1 (Hidden): 3 neurons
Layer 2 (Output): 1 neuron
#+END_EXAMPLE

*What matrices do we need?*

#+BEGIN_SRC c
typedef struct {
    size_t count;  // Number of layers with parameters (2)
    Mat *ws;       // Weight matrices
    Mat *bs;       // Bias matrices
    Mat *as;       // Activation matrices
} NN;
#+END_SRC

For =[2, 3, 1]=:
- =count = 2=
- =ws[0]=: 2×3 (input → hidden)
- =bs[0]=: 1×3 (hidden biases)
- =ws[1]=: 3×1 (hidden → output)
- =bs[1]=: 1×1 (output bias)
- =as[0]=: 1×2 (input activations)
- =as[1]=: 1×3 (hidden activations)
- =as[2]=: 1×1 (output activations)

