doc.html

<li><a id="challenge-matrix-multiplication"></a>🎯 Challenge: Matrix Multiplication<br />
<div class="outline-text-5" id="text-challenge-matrix-multiplication">
<p>
This is the hardest but most important operation!
</p>

<p>
<b>Understanding the Problem:</b>
</p>

<p>
If A is 2×3 and B is 3×4, what size is C = A × B?
</p>

<div class="html" id="org0103977">
<p>
&lt;details&gt;
</p>

</div>

<div class="html" id="orgb59089f">
<p>
&lt;summary&gt;
</p>

</div>

<p>
Click to see answer
</p>

<div class="html" id="orge632944">
<p>
&lt;/summary&gt;
</p>

</div>

<p>
C is 2×4
</p>

<p>
<b>Rule:</b> (m×n) × (n×p) = (m×p)
</p>

<p>
The inner dimensions must match!
</p>

<div class="html" id="org93e9446">
<p>
&lt;/details&gt;
</p>

</div>

<p>
<b>How to compute C[i][j]?</b>
</p>

<div class="html" id="orgd7a65af">
<p>
&lt;details&gt;
</p>

</div>

<div class="html" id="orge1d7d4d">
<p>
&lt;summary&gt;
</p>

</div>

<p>
Click to see answer
</p>

<div class="html" id="orgdcad71c">
<p>
&lt;/summary&gt;
</p>

</div>

<pre class="example" id="org1b9bb70">
C[i][j] = Σ(A[i][k] * B[k][j]) for k = 0 to n-1
</pre>

<p>
This is the dot product of row i of A and column j of B.
</p>

<p>
<b>Example:</b>
</p>

<pre class="example" id="orgea9c469">
A = [1 2]    B = [5 6]
    [3 4]        [7 8]

C[0][0] = 1*5 + 2*7 = 19
C[0][1] = 1*6 + 2*8 = 22
C[1][0] = 3*5 + 4*7 = 43
C[1][1] = 3*6 + 4*8 = 50
</pre>

<div class="html" id="org751855d">
<p>
&lt;/details&gt;
</p>

</div>
</div>
</li>

<li><a id="exercise-implement-mat_dot"></a>✍️ Exercise: Implement mat<sub>dot</sub>()<br />
<div class="outline-text-5" id="text-exercise-implement-mat_dot">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #95a99f;">void</span> <span style="color: #96a6c8;">mat_dot</span>(<span style="color: #95a99f;">Mat</span> <span style="color: #f4f4ff;">dst</span>, <span style="color: #95a99f;">Mat</span> <span style="color: #f4f4ff;">a</span>, <span style="color: #95a99f;">Mat</span> <span style="color: #f4f4ff;">b</span>)
{
    <span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">TODO: Implement matrix multiplication
</span>    <span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">Remember to:
</span>    <span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">1. Assert dimensions are compatible
</span>    <span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">2. Initialize dst to zero
</span>    <span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">3. Compute each element
</span>}
</pre>
</div>

<div class="html" id="org52ef322">
<p>
&lt;details&gt;
</p>

</div>

<div class="html" id="org5d28489">
<p>
&lt;summary&gt;
</p>

</div>

<p>
Click to see the answer
</p>

<div class="html" id="orgd6a8829">
<p>
&lt;/summary&gt;
</p>

</div>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #95a99f;">void</span> <span style="color: #96a6c8;">mat_dot</span>(<span style="color: #95a99f;">Mat</span> <span style="color: #f4f4ff;">dst</span>, <span style="color: #95a99f;">Mat</span> <span style="color: #f4f4ff;">a</span>, <span style="color: #95a99f;">Mat</span> <span style="color: #f4f4ff;">b</span>)
{
    NN_ASSERT(a.cols == b.rows);
    NN_ASSERT(dst.rows == a.rows);
    NN_ASSERT(dst.cols == b.cols);

    <span style="color: #95a99f;">size_t</span> <span style="color: #f4f4ff;">n</span> = a.cols;

    <span style="color: #ffdd33; font-weight: bold;">for</span> (<span style="color: #95a99f;">size_t</span> <span style="color: #f4f4ff;">i</span> = 0; i &lt; dst.rows; ++i) {
        <span style="color: #ffdd33; font-weight: bold;">for</span> (<span style="color: #95a99f;">size_t</span> <span style="color: #f4f4ff;">j</span> = 0; j &lt; dst.cols; ++j) {
            MAT_AT(dst, i, j) = 0;  <span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">Initialize
</span>            <span style="color: #ffdd33; font-weight: bold;">for</span> (<span style="color: #95a99f;">size_t</span> <span style="color: #f4f4ff;">k</span> = 0; k &lt; n; ++k) {
                MAT_AT(dst, i, j) += MAT_AT(a, i, k) * MAT_AT(b, k, j);
            }
        }
    }
}
</pre>
</div>

<div class="html" id="org1ecb31e">
<p>
&lt;/details&gt;
</p>

</div>

<hr />
</div>
</li>
</ol>
</div>

<div id="outline-container-step-4-activation-functions" class="outline-4">
<h4 id="step-4-activation-functions"><span class="section-number-4">1.3.5.</span> Step 4: Activation Functions</h4>
<div class="outline-text-4" id="text-step-4-activation-functions">
</div>
<ol class="org-ol">
<li><a id="what-is-an-activation-function"></a>🤔 What is an activation function?<br />
<div class="outline-text-5" id="text-what-is-an-activation-function">
<div class="html" id="org4685a05">
<p>
&lt;details&gt;
</p>

</div>

<div class="html" id="org772b850">
<p>
&lt;summary&gt;
</p>

</div>

<p>
Click for explanation
</p>

<div class="html" id="orge40b146">
<p>
&lt;/summary&gt;
</p>

</div>

<p>
Activation functions introduce non-linearity into neural networks.
Without them, a neural network is just matrix multiplication, which can
only learn linear relationships.
</p>

<p>
<b>Common activation functions:</b> - <b>Sigmoid:</b> Squashes to (0, 1) - good
for probabilities - <b>ReLU:</b> max(0, x) - simple and fast - <b>Tanh:</b>
Squashes to (-1, 1) - zero-centered
</p>

<div class="html" id="org668ebcc">
<p>
&lt;/details&gt;
</p>

</div>
</div>
</li>

<li><a id="the-sigmoid-function"></a>The Sigmoid Function<br />
<div class="outline-text-5" id="text-the-sigmoid-function">
<pre class="example" id="org9cac7e9">
σ(x) = 1 / (1 + e^(-x))
</pre>

<p>
<b>Properties:</b> - Always outputs between 0 and 1 - Smooth and
differentiable - Derivative is easy: σ'(x) = σ(x) × (1 - σ(x))
</p>
</div>
</li>

<li><a id="exercise-implement-sigmoidf"></a>✍️ Exercise: Implement sigmoidf()<br />
<div class="outline-text-5" id="text-exercise-implement-sigmoidf">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #95a99f;">float</span> <span style="color: #96a6c8;">sigmoidf</span>(<span style="color: #95a99f;">float</span> <span style="color: #f4f4ff;">x</span>)
{
    <span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">TODO: Implement sigmoid
</span>    <span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">Hint: Use expf() from math.h
</span>}
</pre>
</div>

<div class="html" id="org1401db8">
<p>
&lt;details&gt;
</p>

</div>

<div class="html" id="org9bdd7fc">
<p>
&lt;summary&gt;
</p>

</div>

<p>
Click to see the answer
</p>

<div class="html" id="orgafe90f1">
<p>
&lt;/summary&gt;
</p>

</div>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #95a99f;">float</span> <span style="color: #96a6c8;">sigmoidf</span>(<span style="color: #95a99f;">float</span> <span style="color: #f4f4ff;">x</span>)
{
    <span style="color: #ffdd33; font-weight: bold;">return</span> 1.0f / (1.0f + expf(-x));
}
</pre>
</div>

<div class="html" id="org4eaead8">
<p>
&lt;/details&gt;
</p>

</div>
</div>
</li>

<li><a id="exercise-apply-sigmoid-to-a-matrix"></a>✍️ Exercise: Apply sigmoid to a matrix<br />
<div class="outline-text-5" id="text-exercise-apply-sigmoid-to-a-matrix">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #95a99f;">void</span> <span style="color: #96a6c8;">mat_sig</span>(<span style="color: #95a99f;">Mat</span> <span style="color: #f4f4ff;">m</span>)
{
    <span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">TODO: Apply sigmoid to every element
</span>}
</pre>
</div>

<div class="html" id="orgfb104cb">
<p>
&lt;details&gt;
</p>

</div>

<div class="html" id="org1fda59d">
<p>
&lt;summary&gt;
</p>

</div>

<p>
Click to see the answer
</p>

<div class="html" id="orgbddca20">
<p>
&lt;/summary&gt;
</p>

</div>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #95a99f;">void</span> <span style="color: #96a6c8;">mat_sig</span>(<span style="color: #95a99f;">Mat</span> <span style="color: #f4f4ff;">m</span>)
{
    <span style="color: #ffdd33; font-weight: bold;">for</span> (<span style="color: #95a99f;">size_t</span> <span style="color: #f4f4ff;">i</span> = 0; i &lt; m.rows; ++i) {
        <span style="color: #ffdd33; font-weight: bold;">for</span> (<span style="color: #95a99f;">size_t</span> <span style="color: #f4f4ff;">j</span> = 0; j &lt; m.cols; ++j) {
            MAT_AT(m, i, j) = sigmoidf(MAT_AT(m, i, j));
        }
    }
}
</pre>
</div>

<div class="html" id="orga2a6449">
<p>
&lt;/details&gt;
</p>

</div>

<hr />
</div>
</li>
</ol>
</div>

<div id="outline-container-step-5-neural-network" class="outline-4">
<h4 id="step-5-neural-network"><span class="section-number-4">1.3.6.</span> Step 5: Neural Network</h4>
<div class="outline-text-4" id="text-step-5-neural-network">
</div>
<ol class="org-ol">
<li><a id="what-is-a-neural-network"></a>🤔 What is a neural network?<br />
<div class="outline-text-5" id="text-what-is-a-neural-network">
<div class="html" id="orgbd7083b">
<p>
&lt;details&gt;
</p>

</div>

<div class="html" id="org9724686">
<p>
&lt;summary&gt;
</p>

</div>

<p>
Click for explanation
</p>

<div class="html" id="org8cbe871">
<p>
&lt;/summary&gt;
</p>

</div>

<p>
A neural network is composed of layers of neurons: - <b>Input layer:</b>
Receives the raw data - <b>Hidden layers:</b> Process the data (can have
multiple) - <b>Output layer:</b> Produces the final prediction
</p>

<p>
Each connection between neurons has: - <b>Weight (W):</b> How strong the
connection is - <b>Bias (b):</b> An offset/threshold
</p>

<p>
<b>Forward pass:</b>
</p>

<pre class="example" id="orgd9e2dde">
output = σ(input × W + b)
</pre>

<div class="html" id="org89ec20b">
<p>
&lt;/details&gt;
</p>

</div>
</div>
</li>

<li><a id="understanding-the-nn-structure"></a>Understanding the NN Structure<br />
<div class="outline-text-5" id="text-understanding-the-nn-structure">
<p>
For architecture <code>[2, 3, 1]</code>:
</p>

<pre class="example" id="org2d40449">
Layer 0 (Input): 2 neurons
Layer 1 (Hidden): 3 neurons
Layer 2 (Output): 1 neuron
</pre>

<p>
<b>What matrices do we need?</b>
</p>

<div class="html" id="org6289831">
<p>
&lt;details&gt;
</p>

</div>

<div class="html" id="org75693ae">
<p>
&lt;summary&gt;
</p>

</div>

<p>
Click to see answer
</p>

<div class="html" id="orgc57d4fb">
<p>
&lt;/summary&gt;
</p>

</div>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #ffdd33; font-weight: bold;">typedef</span> <span style="color: #ffdd33; font-weight: bold;">struct</span> {
    <span style="color: #95a99f;">size_t</span> <span style="color: #f4f4ff;">count</span>;  <span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">Number of layers with parameters (2)
</span>    <span style="color: #95a99f;">Mat</span> *<span style="color: #f4f4ff;">ws</span>;       <span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">Weight matrices
</span>    <span style="color: #95a99f;">Mat</span> *<span style="color: #f4f4ff;">bs</span>;       <span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">Bias matrices
</span>    <span style="color: #95a99f;">Mat</span> *<span style="color: #f4f4ff;">as</span>;       <span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">Activation matrices
</span>} <span style="color: #95a99f;">NN</span>;
</pre>
</div>

<p>
For <code>[2, 3, 1]</code>: - <code>count = 2</code> - <code>ws[0]</code>: 2×3 (input → hidden) -
<code>bs[0]</code>: 1×3 (hidden biases) - <code>ws[1]</code>: 3×1 (hidden → output) - <code>bs[1]</code>:
1×1 (output bias) - <code>as[0]</code>: 1×2 (input activations) - <code>as[1]</code>: 1×3
(hidden activations) - <code>as[2]</code>: 1×1 (output activations)
</p>

<div class="html" id="org43de698">
<p>
&lt;/details&gt;
</p>

</div>
</div>
</li>
