doc.org
**** ✍️ Exercise: Implement the Forward Pass

The forward pass computes the network's output:

#+BEGIN_SRC c
void nn_forward(NN nn)
{
    // TODO: For each layer:
    // 1. Multiply by weights: a × W
    // 2. Add bias: y + b
    // 3. Apply activation: σ(y)
}
#+END_SRC

*Answer:*

#+BEGIN_SRC c
void nn_forward(NN nn)
{
    for (size_t i = 0; i < nn.count; ++i) {
        mat_dot(nn.as[i + 1], nn.as[i], nn.ws[i]);  // a × W
        mat_sum(nn.as[i + 1], nn.bs[i]);             // + b
        mat_sig(nn.as[i + 1]);                       // σ()
    }
}
#+END_SRC

-----

*** Step 6: Training - The Cost Function

**** 🤔 How do we know if the network is good?

We use a *cost function* (also called loss function) that measures the error.

*Mean Squared Error (MSE):*
#+BEGIN_EXAMPLE
J = (1/n) × Σ(predicted - actual)²
#+END_EXAMPLE

Lower cost = better predictions!

**** ✍️ Exercise: Implement nn_cost()

#+BEGIN_SRC c
float nn_cost(NN nn, Mat ti, Mat to)
{
    // TODO:
    // 1. For each training sample
    // 2. Run forward pass
    // 3. Calculate squared error
    // 4. Return mean error

    return 0.0f;  // Placeholder
}
#+END_SRC

*Answer:*

#+BEGIN_SRC c
float nn_cost(NN nn, Mat ti, Mat to)
{
    NN_ASSERT(ti.rows == to.rows);
    NN_ASSERT(to.cols == NN_OUTPUT(nn).cols);

    size_t n = ti.rows;
    float c = 0;

    for (size_t i = 0; i < n; ++i) {
        Mat x = mat_row(ti, i);
        Mat y = mat_row(to, i);

        mat_copy(NN_INPUT(nn), x);
        nn_forward(nn);

        for (size_t j = 0; j < to.cols; ++j) {
            float d = MAT_AT(NN_OUTPUT(nn), 0, j) - MAT_AT(y, 0, j);
            c += d * d;
        }
    }
    return c / n;
}
#+END_SRC

-----

*** Step 7: Backpropagation

**** 🤔 How do we improve the network?

We use *gradient descent*:
1. Calculate how much each parameter contributes to the error (gradient)
2. Adjust parameters in the opposite direction of the gradient
3. Repeat!

*The Chain Rule:*
#+BEGIN_EXAMPLE
∂Loss/∂Weight = ∂Loss/∂Output × ∂Output/∂Activation × ∂Activation/∂Weight
#+END_EXAMPLE

Backpropagation efficiently computes all gradients using the chain rule!

**** Key Gradients for Sigmoid:

For a single neuron with:
- =a= = activation value
- =da= = error gradient

#+BEGIN_EXAMPLE
Bias gradient:  ∂J/∂b = 2 × da × a × (1 - a)
Weight gradient: ∂J/∂W = 2 × da × a × (1 - a) × previous_activation
#+END_EXAMPLE

**** ✍️ Exercise: Implement Gradient Descent Update

#+BEGIN_SRC c
void nn_learn(NN nn, NN g, float rate)
{
    // TODO: Update each parameter:
    // parameter = parameter - learning_rate × gradient
}
#+END_SRC

*Answer:*

#+BEGIN_SRC c
void nn_learn(NN nn, NN g, float rate)
{
    for (size_t i = 0; i < nn.count; ++i) {
        // Update weights
        for (size_t j = 0; j < nn.ws[i].rows; ++j) {
            for (size_t k = 0; k < nn.ws[i].cols; ++k) {
                MAT_AT(nn.ws[i], j, k) -= rate * MAT_AT(g.ws[i], j, k);
            }
        }
        // Update biases
        for (size_t j = 0; j < nn.bs[i].rows; ++j) {
            for (size_t k = 0; k < nn.bs[i].cols; ++k) {
                MAT_AT(nn.bs[i], j, k) -= rate * MAT_AT(g.bs[i], j, k);
            }
        }
    }
}
#+END_SRC

-----

*** Step 8: Putting It All Together

