doc.html

<li><a id="exercise-implement-the-forward-pass"></a>✍️ Exercise: Implement the Forward Pass<br />
<div class="outline-text-5" id="text-exercise-implement-the-forward-pass">
<p>
The forward pass computes the network's output:
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #95a99f;">void</span> <span style="color: #96a6c8;">nn_forward</span>(<span style="color: #95a99f;">NN</span> <span style="color: #f4f4ff;">nn</span>)
{
    <span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">TODO: For each layer:
</span>    <span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">1. Multiply by weights: a &#215; W
</span>    <span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">2. Add bias: y + b
</span>    <span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">3. Apply activation: &#963;(y)
</span>}
</pre>
</div>

<div class="html" id="orgf71b50c">
<p>
&lt;details&gt;
</p>

</div>

<div class="html" id="orgddcf090">
<p>
&lt;summary&gt;
</p>

</div>

<p>
Click to see the answer
</p>

<div class="html" id="orgb1960e2">
<p>
&lt;/summary&gt;
</p>

</div>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #95a99f;">void</span> <span style="color: #96a6c8;">nn_forward</span>(<span style="color: #95a99f;">NN</span> <span style="color: #f4f4ff;">nn</span>)
{
    <span style="color: #ffdd33; font-weight: bold;">for</span> (<span style="color: #95a99f;">size_t</span> <span style="color: #f4f4ff;">i</span> = 0; i &lt; nn.count; ++i) {
        mat_dot(nn.as[i + 1], nn.as[i], nn.ws[i]);  <span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">a &#215; W
</span>        mat_sum(nn.as[i + 1], nn.bs[i]);             <span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">+ b
</span>        mat_sig(nn.as[i + 1]);                       <span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">&#963;()
</span>    }
}
</pre>
</div>

<div class="html" id="org132e115">
<p>
&lt;/details&gt;
</p>

</div>

<hr />
</div>
</li>
</ol>
</div>

<div id="outline-container-step-6-training---the-cost-function" class="outline-4">
<h4 id="step-6-training---the-cost-function"><span class="section-number-4">1.3.7.</span> Step 6: Training - The Cost Function</h4>
<div class="outline-text-4" id="text-step-6-training---the-cost-function">
</div>
<ol class="org-ol">
<li><a id="how-do-we-know-if-the-network-is-good"></a>🤔 How do we know if the network is good?<br />
<div class="outline-text-5" id="text-how-do-we-know-if-the-network-is-good">
<div class="html" id="orgaf7a3b6">
<p>
&lt;details&gt;
</p>

</div>

<div class="html" id="org4c5b7fc">
<p>
&lt;summary&gt;
</p>

</div>

<p>
Click for explanation
</p>

<div class="html" id="org07ffeca">
<p>
&lt;/summary&gt;
</p>

</div>

<p>
We use a <b>cost function</b> (also called loss function) that measures the
error.
</p>

<p>
<b>Mean Squared Error (MSE):</b>
</p>

<pre class="example" id="orgd2d0bcd">
J = (1/n) × Σ(predicted - actual)²
</pre>

<p>
Lower cost = better predictions!
</p>

<div class="html" id="org545c6d2">
<p>
&lt;/details&gt;
</p>

</div>
</div>
</li>

<li><a id="exercise-implement-nn_cost"></a>✍️ Exercise: Implement nn<sub>cost</sub>()<br />
<div class="outline-text-5" id="text-exercise-implement-nn_cost">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #95a99f;">float</span> <span style="color: #96a6c8;">nn_cost</span>(<span style="color: #95a99f;">NN</span> <span style="color: #f4f4ff;">nn</span>, <span style="color: #95a99f;">Mat</span> <span style="color: #f4f4ff;">ti</span>, <span style="color: #95a99f;">Mat</span> <span style="color: #f4f4ff;">to</span>)
{
    <span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">TODO:
</span>    <span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">1. For each training sample
</span>    <span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">2. Run forward pass
</span>    <span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">3. Calculate squared error
</span>    <span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">4. Return mean error
</span>
    <span style="color: #ffdd33; font-weight: bold;">return</span> 0.0f;  <span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">Placeholder
</span>}
</pre>
</div>

<div class="html" id="orgd7e5a21">
<p>
&lt;details&gt;
</p>

</div>

<div class="html" id="org9f126ac">
<p>
&lt;summary&gt;
</p>

</div>

<p>
Click to see the answer
</p>

<div class="html" id="org9ffa6d2">
<p>
&lt;/summary&gt;
</p>

</div>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #95a99f;">float</span> <span style="color: #96a6c8;">nn_cost</span>(<span style="color: #95a99f;">NN</span> <span style="color: #f4f4ff;">nn</span>, <span style="color: #95a99f;">Mat</span> <span style="color: #f4f4ff;">ti</span>, <span style="color: #95a99f;">Mat</span> <span style="color: #f4f4ff;">to</span>)
{
    NN_ASSERT(ti.rows == to.rows);
    NN_ASSERT(to.cols == NN_OUTPUT(nn).cols);

    <span style="color: #95a99f;">size_t</span> <span style="color: #f4f4ff;">n</span> = ti.rows;
    <span style="color: #95a99f;">float</span> <span style="color: #f4f4ff;">c</span> = 0;

    <span style="color: #ffdd33; font-weight: bold;">for</span> (<span style="color: #95a99f;">size_t</span> <span style="color: #f4f4ff;">i</span> = 0; i &lt; n; ++i) {
        <span style="color: #95a99f;">Mat</span> <span style="color: #f4f4ff;">x</span> = mat_row(ti, i);
        <span style="color: #95a99f;">Mat</span> <span style="color: #f4f4ff;">y</span> = mat_row(to, i);

        mat_copy(NN_INPUT(nn), x);
        nn_forward(nn);

        <span style="color: #ffdd33; font-weight: bold;">for</span> (<span style="color: #95a99f;">size_t</span> <span style="color: #f4f4ff;">j</span> = 0; j &lt; to.cols; ++j) {
            <span style="color: #95a99f;">float</span> <span style="color: #f4f4ff;">d</span> = MAT_AT(NN_OUTPUT(nn), 0, j) - MAT_AT(y, 0, j);
            c += d * d;
        }
    }
    <span style="color: #ffdd33; font-weight: bold;">return</span> c / n;
}
</pre>
</div>

<div class="html" id="org74946b0">
<p>
&lt;/details&gt;
</p>

</div>

<hr />
</div>
</li>
</ol>
</div>

<div id="outline-container-step-7-backpropagation" class="outline-4">
<h4 id="step-7-backpropagation"><span class="section-number-4">1.3.8.</span> Step 7: Backpropagation</h4>
<div class="outline-text-4" id="text-step-7-backpropagation">
</div>
<ol class="org-ol">
<li><a id="how-do-we-improve-the-network"></a>🤔 How do we improve the network?<br />
<div class="outline-text-5" id="text-how-do-we-improve-the-network">
<div class="html" id="orge1735da">
<p>
&lt;details&gt;
</p>

</div>

<div class="html" id="org5bf60e0">
<p>
&lt;summary&gt;
</p>

</div>

<p>
Click for explanation
</p>

<div class="html" id="orgea36304">
<p>
&lt;/summary&gt;
</p>

</div>

<p>
We use <b>gradient descent</b>: 1. Calculate how much each parameter
contributes to the error (gradient) 2. Adjust parameters in the opposite
direction of the gradient 3. Repeat!
</p>

<p>
<b>The Chain Rule:</b>
</p>

<pre class="example" id="orgfbddda8">
∂Loss/∂Weight = ∂Loss/∂Output × ∂Output/∂Activation × ∂Activation/∂Weight
</pre>

<p>
Backpropagation efficiently computes all gradients using the chain rule!
</p>

<div class="html" id="org6db892c">
<p>
&lt;/details&gt;
</p>

</div>
</div>
</li>

<li><a id="key-gradients-for-sigmoid"></a>Key Gradients for Sigmoid:<br />
<div class="outline-text-5" id="text-key-gradients-for-sigmoid">
<p>
For a single neuron with: - <code>a</code> = activation value - <code>da</code> = error
gradient
</p>

<pre class="example" id="org111c439">
Bias gradient:  ∂J/∂b = 2 × da × a × (1 - a)
Weight gradient: ∂J/∂W = 2 × da × a × (1 - a) × previous_activation
</pre>
</div>
</li>

<li><a id="exercise-implement-gradient-descent-update"></a>✍️ Exercise: Implement Gradient Descent Update<br />
<div class="outline-text-5" id="text-exercise-implement-gradient-descent-update">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #95a99f;">void</span> <span style="color: #96a6c8;">nn_learn</span>(<span style="color: #95a99f;">NN</span> <span style="color: #f4f4ff;">nn</span>, <span style="color: #95a99f;">NN</span> <span style="color: #f4f4ff;">g</span>, <span style="color: #95a99f;">float</span> <span style="color: #f4f4ff;">rate</span>)
{
    <span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">TODO: Update each parameter:
</span>    <span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">parameter = parameter - learning_rate &#215; gradient
</span>}
</pre>
</div>

<div class="html" id="org37d98f5">
<p>
&lt;details&gt;
</p>

</div>

<div class="html" id="orgf697edf">
<p>
&lt;summary&gt;
</p>

</div>

<p>
Click to see the answer
</p>

<div class="html" id="orgd6a1688">
<p>
&lt;/summary&gt;
</p>

</div>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #95a99f;">void</span> <span style="color: #96a6c8;">nn_learn</span>(<span style="color: #95a99f;">NN</span> <span style="color: #f4f4ff;">nn</span>, <span style="color: #95a99f;">NN</span> <span style="color: #f4f4ff;">g</span>, <span style="color: #95a99f;">float</span> <span style="color: #f4f4ff;">rate</span>)
{
    <span style="color: #ffdd33; font-weight: bold;">for</span> (<span style="color: #95a99f;">size_t</span> <span style="color: #f4f4ff;">i</span> = 0; i &lt; nn.count; ++i) {
        <span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">Update weights
</span>        <span style="color: #ffdd33; font-weight: bold;">for</span> (<span style="color: #95a99f;">size_t</span> <span style="color: #f4f4ff;">j</span> = 0; j &lt; nn.ws[i].rows; ++j) {
            <span style="color: #ffdd33; font-weight: bold;">for</span> (<span style="color: #95a99f;">size_t</span> <span style="color: #f4f4ff;">k</span> = 0; k &lt; nn.ws[i].cols; ++k) {
                MAT_AT(nn.ws[i], j, k) -= rate * MAT_AT(g.ws[i], j, k);
            }
        }
        <span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">Update biases
</span>        <span style="color: #ffdd33; font-weight: bold;">for</span> (<span style="color: #95a99f;">size_t</span> <span style="color: #f4f4ff;">j</span> = 0; j &lt; nn.bs[i].rows; ++j) {
            <span style="color: #ffdd33; font-weight: bold;">for</span> (<span style="color: #95a99f;">size_t</span> <span style="color: #f4f4ff;">k</span> = 0; k &lt; nn.bs[i].cols; ++k) {
                MAT_AT(nn.bs[i], j, k) -= rate * MAT_AT(g.bs[i], j, k);
            }
        }
    }
}
</pre>
</div>

<div class="html" id="org27483ac">
<p>
&lt;/details&gt;
</p>

</div>

<hr />
</div>
</li>
</ol>
</div>

<div id="outline-container-step-8-putting-it-all-together" class="outline-4">
<h4 id="step-8-putting-it-all-together"><span class="section-number-4">1.3.9.</span> Step 8: Putting It All Together</h4>
<div class="outline-text-4" id="text-step-8-putting-it-all-together">
</div>
<ol class="org-ol">
