doc.org
**** ✍️ Complete Exercise: Train XOR

Try to write a complete program that trains a neural network to solve XOR:

*XOR Truth Table:*
#+BEGIN_EXAMPLE
Input | Output
------|-------
0, 0  | 0
0, 1  | 1
1, 0  | 1
1, 1  | 0
#+END_EXAMPLE

*Complete solution:*

#+BEGIN_SRC c
#define NN_IMPLEMENTATION
#include "nn.h"
#include <stdio.h>

int main(void)
{
    // Define architecture: 2 inputs, 3 hidden, 1 output
    size_t arch[] = {2, 3, 1};
    NN nn = nn_alloc(arch, ARRAY_LEN(arch));
    NN g = nn_alloc(arch, ARRAY_LEN(arch));

    nn_rand(nn, -1, 1);

    // Training data
    float train_data[] = {
        0, 0, 0,
        0, 1, 1,
        1, 0, 1,
        1, 1, 0
    };

    Mat ti = {.rows = 4, .cols = 2, .stride = 3, .es = train_data};
    Mat to = {.rows = 4, .cols = 1, .stride = 3, .es = train_data + 2};

    // Training loop
    float rate = 0.1f;
    for (size_t i = 0; i < 10000; ++i) {
        nn_backprop(nn, g, ti, to);
        nn_learn(nn, g, rate);

        if (i % 1000 == 0) {
            printf("Cost: %f\n", nn_cost(nn, ti, to));
        }
    }

    // Test
    mat_fill(NN_INPUT(nn), 0);
    MAT_AT(NN_INPUT(nn), 0, 0) = 1;
    MAT_AT(NN_INPUT(nn), 0, 1) = 0;
    nn_forward(nn);
    printf("XOR(1, 0) = %f\n", MAT_AT(NN_OUTPUT(nn), 0, 0));

    return 0;
}
#+END_SRC

-----

*** 🎓 Congratulations!

You've now learned:
- ✅ How to represent matrices in C
- ✅ Matrix operations (multiplication, etc.)
- ✅ Activation functions
- ✅ Forward pass in neural networks
- ✅ Cost functions
- ✅ Gradient descent
- ✅ Training a neural network

*Next Steps:*
- Experiment with different architectures
- Try different activation functions (ReLU, Tanh)
- Learn about optimization techniques (momentum, Adam)
- Study regularization (dropout, L2)

-----

*** 📚 Quick Reference

*Essential Concepts:*

| Concept | Formula | Purpose |
|---------|---------|---------|
| Matrix Access | =index = i * stride + j= | Find element in memory |
| Matrix Multiply | =C[i][j] = Σ(A[i][k] * B[k][j])= | Transform data |
| Sigmoid | =σ(x) = 1/(1 + e^(-x))= | Squash to (0,1) |
| Forward Pass | =a = σ(input × W + b)= | Compute prediction |
| MSE Cost | =J = Σ(predicted - actual)² / n= | Measure error |
| Gradient Descent | =param = param - rate × gradient= | Minimize error |

-----

* Header Guards

#+BEGIN_SRC c
#ifndef NN_H_
#define NN_H_
...
#endif // NN_H_
#+END_SRC

** What are header guards?
Header guards prevent the same header file from being included multiple times in a single compilation unit. Without them, you'd get "redefinition" errors.

** How they work:
1. First time: =NN_H_= is not defined, so it gets defined and content is included
2. Subsequent times: =NN_H_= is already defined, so the entire file is skipped

-----

* Includes and Dependencies

#+BEGIN_SRC c
#include <stdbool.h>   // For bool type
#include <stddef.h>    // For size_t type
#include <stdio.h>     // For file I/O and printf
#include <time.h>      // For random number seeding
#include <math.h>      // For expf() and sigmoid function
#include <stdint.h>    // For fixed-width integers
#include <float.h>     // For float constants (FLT_MAX, etc.)
#include <string.h>    // For memcpy, strlen
#+END_SRC

Each include provides specific functionality:
- *stdbool.h*: Boolean type (=true=, =false=)
- *stddef.h*: Size type and NULL constant
- *stdio.h*: Input/output operations
- *math.h*: Mathematical functions
- *stdlib.h*: Memory allocation (malloc)

-----

* Configurable Macros

** Memory Allocation Customization

#+BEGIN_SRC c
#ifndef NN_MALLOC
#include <stdlib.h>
#define NN_MALLOC malloc
#endif // NN_MALLOC
#+END_SRC

** Why this is useful:
- Allows users to inject custom memory allocators
- Useful for debugging (can track allocations)
- Useful for embedded systems (might use different allocation strategy)

** Assertion Customization

#+BEGIN_SRC c
#ifndef NN_ASSERT
#include <assert.h>
#define NN_ASSERT assert
#endif // NN_ASSERT
#+END_SRC

Similar to =NN_MALLOC=, this allows custom assertion behavior.

