doc.html
<li><a id="complete-exercise-train-xor"></a>✍️ Complete Exercise: Train XOR<br />
<div class="outline-text-5" id="text-complete-exercise-train-xor">
<p>
Try to write a complete program that trains a neural network to solve
XOR:
</p>

<p>
<b>XOR Truth Table:</b>
</p>

<pre class="example" id="org3110da3">
Input | Output
------|-------
0, 0  | 0
0, 1  | 1
1, 0  | 1
1, 1  | 0
</pre>

<div class="html" id="orgef96444">
<p>
&lt;details&gt;
</p>

</div>

<div class="html" id="org95012fe">
<p>
&lt;summary&gt;
</p>

</div>

<p>
Click for a complete solution
</p>

<div class="html" id="org0764aea">
<p>
&lt;/summary&gt;
</p>

</div>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #95a99f;">#define</span> <span style="color: #f4f4ff;">NN_IMPLEMENTATION</span>
<span style="color: #95a99f;">#include</span> <span style="color: #73c936;">"nn.h"</span>
<span style="color: #95a99f;">#include</span> <span style="color: #73c936;">&lt;stdio.h&gt;</span>

<span style="color: #95a99f;">int</span> <span style="color: #96a6c8;">main</span>(<span style="color: #95a99f;">void</span>)
{
    <span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">Define architecture: 2 inputs, 3 hidden, 1 output
</span>    <span style="color: #95a99f;">size_t</span> <span style="color: #f4f4ff;">arch</span>[] = {2, 3, 1};
    <span style="color: #95a99f;">NN</span> <span style="color: #f4f4ff;">nn</span> = nn_alloc(arch, ARRAY_LEN(arch));
    <span style="color: #95a99f;">NN</span> <span style="color: #f4f4ff;">g</span> = nn_alloc(arch, ARRAY_LEN(arch));

    nn_rand(nn, -1, 1);

    <span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">Training data
</span>    <span style="color: #95a99f;">float</span> <span style="color: #f4f4ff;">train_data</span>[] = {
        0, 0, 0,
        0, 1, 1,
        1, 0, 1,
        1, 1, 0
    };

    <span style="color: #95a99f;">Mat</span> <span style="color: #f4f4ff;">ti</span> = {.rows = 4, .cols = 2, .stride = 3, .es = train_data};
    <span style="color: #95a99f;">Mat</span> <span style="color: #f4f4ff;">to</span> = {.rows = 4, .cols = 1, .stride = 3, .es = train_data + 2};

    <span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">Training loop
</span>    <span style="color: #95a99f;">float</span> <span style="color: #f4f4ff;">rate</span> = 0.1f;
    <span style="color: #ffdd33; font-weight: bold;">for</span> (<span style="color: #95a99f;">size_t</span> <span style="color: #f4f4ff;">i</span> = 0; i &lt; 10000; ++i) {
        nn_backprop(nn, g, ti, to);
        nn_learn(nn, g, rate);

        <span style="color: #ffdd33; font-weight: bold;">if</span> (i % 1000 == 0) {
            printf(<span style="color: #73c936;">"Cost: %f\n"</span>, nn_cost(nn, ti, to));
        }
    }

    <span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">Test
</span>    mat_fill(NN_INPUT(nn), 0);
    MAT_AT(NN_INPUT(nn), 0, 0) = 1;
    MAT_AT(NN_INPUT(nn), 0, 1) = 0;
    nn_forward(nn);
    printf(<span style="color: #73c936;">"XOR(1, 0) = %f\n"</span>, MAT_AT(NN_OUTPUT(nn), 0, 0));

    <span style="color: #ffdd33; font-weight: bold;">return</span> 0;
}
</pre>
</div>

<div class="html" id="org57d5070">
<p>
&lt;/details&gt;
</p>

</div>

<hr />
</div>
</li>
</ol>
</div>

<div id="outline-container-congratulations" class="outline-4">
<h4 id="congratulations"><span class="section-number-4">1.3.10.</span> 🎓 Congratulations!</h4>
<div class="outline-text-4" id="text-congratulations">
<p>
You've now learned: - ✅ How to represent matrices in C - ✅ Matrix
operations (multiplication, etc.) - ✅ Activation functions - ✅ Forward
pass in neural networks - ✅ Cost functions - ✅ Gradient descent - ✅
Training a neural network
</p>

<p>
<b>Next Steps:</b> - Experiment with different architectures - Try different
activation functions (ReLU, Tanh) - Learn about optimization techniques
(momentum, Adam) - Study regularization (dropout, L2)
</p>

<hr />
</div>
</div>

<div id="outline-container-quick-reference" class="outline-4">
<h4 id="quick-reference"><span class="section-number-4">1.3.11.</span> 📚 Quick Reference</h4>
<div class="outline-text-4" id="text-quick-reference">
<p>
<b>Essential Concepts:</b>
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Concept</th>
<th scope="col" class="org-left">Formula</th>
<th scope="col" class="org-left">Purpose</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Matrix Access</td>
<td class="org-left"><code>index = i * stride + j</code></td>
<td class="org-left">Find element in memory</td>
</tr>

<tr>
<td class="org-left">Matrix Multiply</td>
<td class="org-left"><code>C[i][j] = Σ(A[i][k] * B[k][j])</code></td>
<td class="org-left">Transform data</td>
</tr>

<tr>
<td class="org-left">Sigmoid</td>
<td class="org-left"><code>σ(x) = 1/(1 + e^(-x))</code></td>
<td class="org-left">Squash to (0,1)</td>
</tr>

<tr>
<td class="org-left">Forward Pass</td>
<td class="org-left"><code>a = σ(input × W + b)</code></td>
<td class="org-left">Compute prediction</td>
</tr>

<tr>
<td class="org-left">MSE Cost</td>
<td class="org-left"><code>J = Σ(predicted - actual)² / n</code></td>
<td class="org-left">Measure error</td>
</tr>

<tr>
<td class="org-left">Gradient Descent</td>
<td class="org-left"><code>param = param - rate × gradient</code></td>
<td class="org-left">Minimize error</td>
</tr>
</tbody>
</table>

<hr />
</div>
</div>
</div>

<div id="outline-container-header-guards" class="outline-3">
<h3 id="header-guards"><span class="section-number-3">1.4.</span> Header Guards</h3>
<div class="outline-text-3" id="text-header-guards">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #95a99f;">#if</span><span style="color: #95a99f;">n</span><span style="color: #95a99f;">def</span> NN_H_
<span style="color: #95a99f;">#define</span> <span style="color: #f4f4ff;">NN_H_</span>
...
<span style="color: #95a99f;">#endif</span> <span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">NN_H_</span>
</pre>
</div>
</div>

<div id="outline-container-what-are-header-guards" class="outline-4">
<h4 id="what-are-header-guards"><span class="section-number-4">1.4.1.</span> What are header guards?</h4>
<div class="outline-text-4" id="text-what-are-header-guards">
<p>
Header guards prevent the same header file from being included multiple
times in a single compilation unit. Without them, you'd get
"redefinition" errors.
</p>
</div>
</div>

<div id="outline-container-how-they-work" class="outline-4">
<h4 id="how-they-work"><span class="section-number-4">1.4.2.</span> How they work:</h4>
<div class="outline-text-4" id="text-how-they-work">
<ol class="org-ol">
<li>First time: <code>NN_H_</code> is not defined, so it gets defined and content is
included</li>
<li>Subsequent times: <code>NN_H_</code> is already defined, so the entire file is
skipped</li>
</ol>

<hr />
</div>
</div>
</div>

<div id="outline-container-includes-and-dependencies" class="outline-3">
<h3 id="includes-and-dependencies"><span class="section-number-3">1.5.</span> Includes and Dependencies</h3>
<div class="outline-text-3" id="text-includes-and-dependencies">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #95a99f;">#include</span> <span style="color: #73c936;">&lt;stdbool.h&gt;</span>   <span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">For bool type
</span><span style="color: #95a99f;">#include</span> <span style="color: #73c936;">&lt;stddef.h&gt;</span>    <span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">For size_t type
</span><span style="color: #95a99f;">#include</span> <span style="color: #73c936;">&lt;stdio.h&gt;</span>     <span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">For file I/O and printf
</span><span style="color: #95a99f;">#include</span> <span style="color: #73c936;">&lt;time.h&gt;</span>      <span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">For random number seeding
</span><span style="color: #95a99f;">#include</span> <span style="color: #73c936;">&lt;math.h&gt;</span>      <span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">For expf() and sigmoid function
</span><span style="color: #95a99f;">#include</span> <span style="color: #73c936;">&lt;stdint.h&gt;</span>    <span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">For fixed-width integers
</span><span style="color: #95a99f;">#include</span> <span style="color: #73c936;">&lt;float.h&gt;</span>     <span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">For float constants (FLT_MAX, etc.)
</span><span style="color: #95a99f;">#include</span> <span style="color: #73c936;">&lt;string.h&gt;</span>    <span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">For memcpy, strlen</span>
</pre>
</div>

<p>
Each include provides specific functionality: - <b>stdbool.h</b>: Boolean
type (<code>true</code>, <code>false</code>) - <b>stddef.h</b>: Size type and NULL constant -
<b>stdio.h</b>: Input/output operations - <b>math.h</b>: Mathematical functions -
<b>stdlib.h</b>: Memory allocation (malloc)
</p>

<hr />
</div>
</div>

<div id="outline-container-configurable-macros" class="outline-3">
<h3 id="configurable-macros"><span class="section-number-3">1.6.</span> Configurable Macros</h3>
<div class="outline-text-3" id="text-configurable-macros">
</div>
<div id="outline-container-memory-allocation-customization" class="outline-4">
<h4 id="memory-allocation-customization"><span class="section-number-4">1.6.1.</span> Memory Allocation Customization</h4>
<div class="outline-text-4" id="text-memory-allocation-customization">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #95a99f;">#if</span><span style="color: #95a99f;">n</span><span style="color: #95a99f;">def</span> NN_MALLOC
<span style="color: #95a99f;">#include</span> <span style="color: #73c936;">&lt;stdlib.h&gt;</span>
<span style="color: #95a99f;">#define</span> <span style="color: #f4f4ff;">NN_MALLOC</span> malloc
<span style="color: #95a99f;">#endif</span> <span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">NN_MALLOC</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-why-this-is-useful" class="outline-4">
<h4 id="why-this-is-useful"><span class="section-number-4">1.6.2.</span> Why this is useful:</h4>
<div class="outline-text-4" id="text-why-this-is-useful">
<ul class="org-ul">
<li>Allows users to inject custom memory allocators</li>
<li>Useful for debugging (can track allocations)</li>
<li>Useful for embedded systems (might use different allocation strategy)</li>
</ul>
</div>
</div>

<div id="outline-container-assertion-customization" class="outline-4">
<h4 id="assertion-customization"><span class="section-number-4">1.6.3.</span> Assertion Customization</h4>
<div class="outline-text-4" id="text-assertion-customization">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #95a99f;">#if</span><span style="color: #95a99f;">n</span><span style="color: #95a99f;">def</span> NN_ASSERT
<span style="color: #95a99f;">#include</span> <span style="color: #73c936;">&lt;assert.h&gt;</span>
<span style="color: #95a99f;">#define</span> <span style="color: #f4f4ff;">NN_ASSERT</span> assert
<span style="color: #95a99f;">#endif</span> <span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">NN_ASSERT</span>
</pre>
</div>

<p>
Similar to <code>NN_MALLOC</code>, this allows custom assertion behavior.
</p>
</div>
</div>
