doc.org
** Array Length Macro

#+BEGIN_SRC c
#define ARRAY_LEN(xs) sizeof((xs)) / sizeof((xs)[0])
#+END_SRC

This calculates the number of elements in a static array.

*Example:*
#+BEGIN_SRC c
int arr[] = {1, 2, 3, 4, 5};
size_t len = ARRAY_LEN(arr); // len = 5
#+END_SRC

-----

* Data Structures

** 1. Gym_Batch - Batch Processing State

#+BEGIN_SRC c
typedef struct {
    size_t begin;      // Starting index for current batch
    float cost;        // Accumulated cost for the batch
    bool finished;     // Whether batch processing is complete
} Gym_Batch;
#+END_SRC

This tracks progress when processing data in mini-batches for training.

** 2. Mat - Matrix Structure

#+BEGIN_SRC c
typedef struct {
    size_t rows;      // Number of rows
    size_t cols;      // Number of columns
    size_t stride;    // Elements per row in memory (enables row views)
    float *es;        // Pointer to matrix elements
} Mat;
#+END_SRC

*** Understanding =stride=:
The stride is an advanced feature that allows efficient row operations. A normal matrix has =stride == cols=, but row views can share memory with the parent matrix.

*Example:*
#+BEGIN_EXAMPLE
// Original matrix: 3x4
// Memory layout: [a,b,c,d, e,f,g,h, i,j,k,l]

// Row 1 view: 1x4
// stride = 4 (same as parent)
// es points to 'e' element
#+END_EXAMPLE

** Matrix Access Macro

#+BEGIN_SRC c
#define MAT_AT(m, i, j) (m).es[(i)*(m).stride + (j)]
#+END_SRC

This macro accesses element at row =i=, column =j=.

** How it works:
#+BEGIN_EXAMPLE
Memory index = row * stride + column
#+END_EXAMPLE

*Example:*
#+BEGIN_SRC c
Mat m = {
    .rows = 2,
    .cols = 3,
    .stride = 3,
    .es = {1,2,3, 4,5,6}
};

MAT_AT(m, 1, 2) = m.es[1*3 + 2] = m.es[5] = 6
#+END_SRC

-----

* Matrix Operations

** 1. mat_alloc() - Create a Matrix

#+BEGIN_SRC c
Mat mat_alloc(size_t rows, size_t cols)
{
    Mat m;
    m.rows = rows;
    m.cols = cols;
    m.stride = cols;  // stride equals cols for new matrices
    m.es = NN_MALLOC(sizeof(*m.es)*rows*cols);
    NN_ASSERT(m.es != NULL);
    return m;
}
#+END_SRC

** What it does:
1. Sets matrix dimensions
2. Allocates memory for all elements
3. Returns the initialized matrix

** 2. mat_fill() - Fill Matrix with Value

#+BEGIN_SRC c
void mat_fill(Mat m, float x)
{
    for(size_t i = 0; i < m.rows; ++i) {
        for(size_t j = 0; j < m.cols; ++j) {
            MAT_AT(m, i, j) = x;
        }
    }
}
#+END_SRC

** 3. mat_dot() - Matrix Multiplication

#+BEGIN_SRC c
void mat_dot(Mat dst, Mat a, Mat b)
{
    NN_ASSERT(a.cols == b.rows);
    NN_ASSERT(dst.rows == a.rows);
    NN_ASSERT(dst.cols == b.cols);

    for(size_t i = 0; i < dst.rows; ++i) {
        for(size_t j = 0; j < dst.cols; ++j) {
            MAT_AT(dst, i, j) = 0;
            for(size_t k = 0; k < a.cols; ++k) {
                MAT_AT(dst, i, j) += MAT_AT(a, i, k) * MAT_AT(b, k, j);
            }
        }
    }
}
#+END_SRC

*** Understanding Matrix Multiplication:

Given matrices A (m×n) and B (n×p), the product C = A×B (m×p) is:

#+BEGIN_EXAMPLE
C[i][j] = Σ(A[i][k] * B[k][j]) for k = 0 to n-1
#+END_EXAMPLE

*Example:*
#+BEGIN_EXAMPLE
A = [1 2]    B = [5 6]
    [3 4]        [7 8]

C[0][0] = 1*5 + 2*7 = 5 + 14 = 19
C[0][1] = 1*6 + 2*8 = 6 + 16 = 22
C[1][0] = 3*5 + 4*7 = 15 + 28 = 43
C[1][1] = 3*6 + 4*8 = 18 + 32 = 50

C = [19 22]
    [43 50]
#+END_EXAMPLE

** 4. mat_row() - Create a Row View

#+BEGIN_SRC c
Mat mat_row(Mat m, size_t row)
{
    return (Mat) {
        .rows = 1,
        .cols = m.cols,
        .stride = m.stride,  // Share stride with parent
        .es = &MAT_AT(m, row, 0),  // Point to row's first element
    };
}
#+END_SRC

This creates a 1×cols matrix that *shares memory* with the parent matrix. No copying occurs!

