doc.html

<div id="outline-container-array-length-macro" class="outline-4">
<h4 id="array-length-macro"><span class="section-number-4">1.6.4.</span> Array Length Macro</h4>
<div class="outline-text-4" id="text-array-length-macro">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #95a99f;">#define</span> <span style="color: #96a6c8;">ARRAY_LEN</span>(<span style="color: #f4f4ff;">xs</span>) <span style="color: #ffdd33; font-weight: bold;">sizeof</span>((xs)) / <span style="color: #ffdd33; font-weight: bold;">sizeof</span>((xs)[0])
</pre>
</div>

<p>
This calculates the number of elements in a static array.
</p>

<p>
<b>Example:</b>
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #95a99f;">int</span> <span style="color: #f4f4ff;">arr</span>[] = {1, 2, 3, 4, 5};
<span style="color: #95a99f;">size_t</span> <span style="color: #f4f4ff;">len</span> = ARRAY_LEN(arr); <span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">len = 5</span>
</pre>
</div>

<hr />
</div>
</div>
</div>

<div id="outline-container-data-structures" class="outline-3">
<h3 id="data-structures"><span class="section-number-3">1.7.</span> Data Structures</h3>
<div class="outline-text-3" id="text-data-structures">
</div>
<div id="outline-container-gym_batch---batch-processing-state" class="outline-4">
<h4 id="gym_batch---batch-processing-state"><span class="section-number-4">1.7.1.</span> 1. Gym<sub>Batch</sub> - Batch Processing State</h4>
<div class="outline-text-4" id="text-gym_batch---batch-processing-state">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #ffdd33; font-weight: bold;">typedef</span> <span style="color: #ffdd33; font-weight: bold;">struct</span> {
    <span style="color: #95a99f;">size_t</span> <span style="color: #f4f4ff;">begin</span>;      <span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">Starting index for current batch
</span>    <span style="color: #95a99f;">float</span> <span style="color: #f4f4ff;">cost</span>;        <span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">Accumulated cost for the batch
</span>    <span style="color: #95a99f;">bool</span> <span style="color: #f4f4ff;">finished</span>;     <span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">Whether batch processing is complete
</span>} <span style="color: #95a99f;">Gym_Batch</span>;
</pre>
</div>

<p>
This tracks progress when processing data in mini-batches for training.
</p>
</div>
</div>

<div id="outline-container-mat---matrix-structure" class="outline-4">
<h4 id="mat---matrix-structure"><span class="section-number-4">1.7.2.</span> 2. Mat - Matrix Structure</h4>
<div class="outline-text-4" id="text-mat---matrix-structure">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #ffdd33; font-weight: bold;">typedef</span> <span style="color: #ffdd33; font-weight: bold;">struct</span> {
    <span style="color: #95a99f;">size_t</span> <span style="color: #f4f4ff;">rows</span>;      <span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">Number of rows
</span>    <span style="color: #95a99f;">size_t</span> <span style="color: #f4f4ff;">cols</span>;      <span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">Number of columns
</span>    <span style="color: #95a99f;">size_t</span> <span style="color: #f4f4ff;">stride</span>;    <span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">Elements per row in memory (enables row views)
</span>    <span style="color: #95a99f;">float</span> *<span style="color: #f4f4ff;">es</span>;        <span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">Pointer to matrix elements
</span>} <span style="color: #95a99f;">Mat</span>;
</pre>
</div>
</div>

<ol class="org-ol">
<li><a id="understanding-stride"></a>Understanding <code>stride</code>:<br />
<div class="outline-text-5" id="text-understanding-stride">
<p>
The stride is an advanced feature that allows efficient row operations.
A normal matrix has <code>stride =</code> cols=, but row views can share memory
with the parent matrix.
</p>

<p>
<b>Example:</b>
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">Original matrix: 3x4
</span><span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">Memory layout: [a,b,c,d, e,f,g,h, i,j,k,l]
</span>
<span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">Row 1 view: 1x4
</span><span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">stride = 4 (same as parent)
</span><span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">es points to 'e' element</span>
</pre>
</div>
</div>
</li>
</ol>
</div>

<div id="outline-container-matrix-access-macro" class="outline-4">
<h4 id="matrix-access-macro"><span class="section-number-4">1.7.3.</span> Matrix Access Macro</h4>
<div class="outline-text-4" id="text-matrix-access-macro">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #95a99f;">#define</span> <span style="color: #96a6c8;">MAT_AT</span>(<span style="color: #f4f4ff;">m</span>, <span style="color: #f4f4ff;">i</span>, <span style="color: #f4f4ff;">j</span>) (m).es[(i)*(m).stride + (j)]
</pre>
</div>

<p>
This macro accesses element at row <code>i</code>, column <code>j</code>.
</p>

<p>
<b>How it works:</b>
</p>

<pre class="example" id="org1bb0267">
Memory index = row * stride + column
</pre>

<p>
<b>Example:</b>
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #95a99f;">Mat</span> <span style="color: #f4f4ff;">m</span> = {
    .rows = 2,
    .cols = 3,
    .stride = 3,
    .es = {1,2,3, 4,5,6}
};

<span style="color: #96a6c8;">MAT_AT</span>(m, 1, 2) = m.es[1*3 + 2] = m.es[5] = 6
</pre>
</div>

<hr />
</div>
</div>
</div>

<div id="outline-container-matrix-operations" class="outline-3">
<h3 id="matrix-operations"><span class="section-number-3">1.8.</span> Matrix Operations</h3>
<div class="outline-text-3" id="text-matrix-operations">
</div>
<div id="outline-container-mat_alloc---create-a-matrix" class="outline-4">
<h4 id="mat_alloc---create-a-matrix"><span class="section-number-4">1.8.1.</span> 1. mat<sub>alloc</sub>() - Create a Matrix</h4>
<div class="outline-text-4" id="text-mat_alloc---create-a-matrix">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #95a99f;">Mat</span> <span style="color: #96a6c8;">mat_alloc</span>(<span style="color: #95a99f;">size_t</span> <span style="color: #f4f4ff;">rows</span>, <span style="color: #95a99f;">size_t</span> <span style="color: #f4f4ff;">cols</span>)
{
    <span style="color: #95a99f;">Mat</span> <span style="color: #f4f4ff;">m</span>;
    m.rows = rows;
    m.cols = cols;
    m.stride = cols;  <span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">stride equals cols for new matrices
</span>    m.es = NN_MALLOC(<span style="color: #ffdd33; font-weight: bold;">sizeof</span>(*m.es)*rows*cols);
    NN_ASSERT(m.es != <span style="color: #95a99f;">NULL</span>);
    <span style="color: #ffdd33; font-weight: bold;">return</span> m;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-what-it-does" class="outline-4">
<h4 id="what-it-does"><span class="section-number-4">1.8.2.</span> What it does:</h4>
<div class="outline-text-4" id="text-what-it-does">
<ol class="org-ol">
<li>Sets matrix dimensions</li>
<li>Allocates memory for all elements</li>
<li>Returns the initialized matrix</li>
</ol>
</div>
</div>

<div id="outline-container-mat_fill---fill-matrix-with-value" class="outline-4">
<h4 id="mat_fill---fill-matrix-with-value"><span class="section-number-4">1.8.3.</span> 2. mat<sub>fill</sub>() - Fill Matrix with Value</h4>
<div class="outline-text-4" id="text-mat_fill---fill-matrix-with-value">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #95a99f;">void</span> <span style="color: #96a6c8;">mat_fill</span>(<span style="color: #95a99f;">Mat</span> <span style="color: #f4f4ff;">m</span>, <span style="color: #95a99f;">float</span> <span style="color: #f4f4ff;">x</span>)
{
    <span style="color: #ffdd33; font-weight: bold;">for</span>(<span style="color: #95a99f;">size_t</span> <span style="color: #f4f4ff;">i</span> = 0; i &lt; m.rows; ++i) {
        <span style="color: #ffdd33; font-weight: bold;">for</span>(<span style="color: #95a99f;">size_t</span> <span style="color: #f4f4ff;">j</span> = 0; j &lt; m.cols; ++j) {
            MAT_AT(m, i, j) = x;
        }
    }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-mat_dot---matrix-multiplication" class="outline-4">
<h4 id="mat_dot---matrix-multiplication"><span class="section-number-4">1.8.4.</span> 3. mat<sub>dot</sub>() - Matrix Multiplication</h4>
<div class="outline-text-4" id="text-mat_dot---matrix-multiplication">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #95a99f;">void</span> <span style="color: #96a6c8;">mat_dot</span>(<span style="color: #95a99f;">Mat</span> <span style="color: #f4f4ff;">dst</span>, <span style="color: #95a99f;">Mat</span> <span style="color: #f4f4ff;">a</span>, <span style="color: #95a99f;">Mat</span> <span style="color: #f4f4ff;">b</span>)
{
    NN_ASSERT(a.cols == b.rows);
    NN_ASSERT(dst.rows == a.rows);
    NN_ASSERT(dst.cols == b.cols);

    <span style="color: #ffdd33; font-weight: bold;">for</span>(<span style="color: #95a99f;">size_t</span> <span style="color: #f4f4ff;">i</span> = 0; i &lt; dst.rows; ++i) {
        <span style="color: #ffdd33; font-weight: bold;">for</span>(<span style="color: #95a99f;">size_t</span> <span style="color: #f4f4ff;">j</span> = 0; j &lt; dst.cols; ++j) {
            MAT_AT(dst, i, j) = 0;
            <span style="color: #ffdd33; font-weight: bold;">for</span>(<span style="color: #95a99f;">size_t</span> <span style="color: #f4f4ff;">k</span> = 0; k &lt; a.cols; ++k) {
                MAT_AT(dst, i, j) += MAT_AT(a, i, k) * MAT_AT(b, k, j);
            }
        }
    }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-understanding-matrix-multiplication" class="outline-4">
<h4 id="understanding-matrix-multiplication"><span class="section-number-4">1.8.5.</span> Understanding Matrix Multiplication:</h4>
<div class="outline-text-4" id="text-understanding-matrix-multiplication">
<p>
Given matrices A (m×n) and B (n×p), the product C = A×B (m×p) is:
</p>

<pre class="example" id="org73c804a">
C[i][j] = Σ(A[i][k] * B[k][j]) for k = 0 to n-1
</pre>

<p>
<b>Example:</b>
</p>

<pre class="example" id="orgcf5e4e8">
A = [1 2]    B = [5 6]
    [3 4]        [7 8]

C[0][0] = 1*5 + 2*7 = 5 + 14 = 19
C[0][1] = 1*6 + 2*8 = 6 + 16 = 22
C[1][0] = 3*5 + 4*7 = 15 + 28 = 43
C[1][1] = 3*6 + 4*8 = 18 + 32 = 50

C = [19 22]
    [43 50]
</pre>
</div>
</div>

<div id="outline-container-mat_row---create-a-row-view" class="outline-4">
<h4 id="mat_row---create-a-row-view"><span class="section-number-4">1.8.6.</span> 4. mat<sub>row</sub>() - Create a Row View</h4>
<div class="outline-text-4" id="text-mat_row---create-a-row-view">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #95a99f;">Mat</span> <span style="color: #96a6c8;">mat_row</span>(<span style="color: #95a99f;">Mat</span> <span style="color: #f4f4ff;">m</span>, <span style="color: #95a99f;">size_t</span> <span style="color: #f4f4ff;">row</span>)
{
    <span style="color: #ffdd33; font-weight: bold;">return</span> (Mat) {
        .rows = 1,
        .cols = m.cols,
        .stride = m.stride,  <span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">Share stride with parent
</span>        .es = &amp;MAT_AT(m, row, 0),  <span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">Point to row's first element
</span>    };
}
</pre>
</div>

<p>
This creates a 1×cols matrix that <b>shares memory</b> with the parent
matrix. No copying occurs!
</p>
</div>
</div>
