doc.org
** 5. mat_sig() - Apply Sigmoid Activation

#+BEGIN_SRC c
void mat_sig(Mat m)
{
    for(size_t i = 0; i < m.rows; ++i) {
        for(size_t j = 0; j < m.cols; ++j) {
            MAT_AT(m, i, j) = sigmoidf(MAT_AT(m, i, j));
        }
    }
}

float sigmoidf(float x)
{
    return 1.f / (1.f + expf(-x));
}
#+END_SRC

*** The Sigmoid Function:
#+BEGIN_EXAMPLE
σ(x) = 1 / (1 + e^(-x))
#+END_EXAMPLE

*Properties:*
- Output range: (0, 1)
- Squashes any input to between 0 and 1
- Differentiable (important for backpropagation)

** 6. mat_sum() - Element-wise Addition

#+BEGIN_SRC c
void mat_sum(Mat dst, Mat a)
{
    NN_ASSERT(dst.rows == a.rows);
    NN_ASSERT(dst.cols == a.cols);
    for(size_t i = 0; i < dst.rows; ++i) {
        for(size_t j = 0; j < dst.cols; ++j) {
            MAT_AT(dst, i, j) += MAT_AT(a, i, j);
        }
    }
}
#+END_SRC

Adds corresponding elements: =dst[i][j] += a[i][j]=

** 7. mat_copy() - Copy Matrix Data

#+BEGIN_SRC c
void mat_copy(Mat dst, Mat src)
{
    NN_ASSERT(dst.rows == src.rows);
    NN_ASSERT(dst.cols == src.cols);
    for(size_t i = 0; i < dst.rows; ++i) {
        for(size_t j = 0; j < dst.cols; ++j) {
            MAT_AT(dst, i, j) = MAT_AT(src, i, j);
        }
    }
}
#+END_SRC

** 8. mat_rand() - Random Initialization

#+BEGIN_SRC c
void mat_rand(Mat m, float low, float high)
{
    for(size_t i = 0; i < m.rows; ++i) {
        for(size_t j = 0; j < m.cols; ++j) {
            MAT_AT(m, i, j) = rand_float() * (high - low) + low;
        }
    }
}

float rand_float(void)
{
    return (float)rand()/(float)RAND_MAX;
}
#+END_SRC

Generates random floats in range [low, high].

** 9. mat_save() and mat_load() - Persistence

#+BEGIN_SRC c
void mat_save(FILE *out, Mat m)
{
    const char *magic = "nn.h.mat";
    fwrite(magic, strlen(magic), 1, out);
    fwrite(&m.rows, sizeof(m.rows), 1, out);
    fwrite(&m.cols, sizeof(m.cols), 1, out);
    for(size_t i = 0; i < m.rows; ++i) {
        size_t n = fwrite(&MAT_AT(m, i, 0), sizeof(*m.es), m.cols, out);
        while(n < m.cols && !ferror(out)) {
            size_t k = fwrite(m.es + n, sizeof(*m.es), m.cols - n, out);
            n += k;
        }
    }
}
#+END_SRC

Saves matrix to file with magic number for validation.

** 10. mat_print() - Debug Output

#+BEGIN_SRC c
void mat_print(Mat m, const char *name, size_t padding)
{
    printf("%*s%s = [\n",(int)padding, "", name);
    for(size_t i = 0; i < m.rows; ++i) {
        printf("%*s    ", (int)padding, "");
        for(size_t j = 0; j < m.cols; ++j) {
            printf("%f ", MAT_AT(m, i, j));
        }
        printf("\n");
    }
    printf("%*s]\n", (int)padding, "");
}

#define MAT_PRINT(m) mat_print(m, #m, 0)
#+END_SRC

The =MAT_PRINT= macro uses stringification (=#m=) to automatically use the variable name as the label.

** 11. mat_shuffle_rows() - Random Row Shuffling

#+BEGIN_SRC c
void mat_shuffle_rows(Mat m)
{
    for(size_t i = 0; i < m.rows; ++i) {
        size_t j = i + rand() % (m.rows - i);
        if(i != j) {
            for(size_t k = 0; k < m.cols; ++k) {
                float t = MAT_AT(m, i, k);
                MAT_AT(m, i, k) = MAT_AT(m, j, k);
                MAT_AT(m, j, k) = t;
            }
        }
    }
}
#+END_SRC

Uses Fisher-Yates shuffle algorithm for randomness. Important for training to avoid order bias.

-----

* Neural Network Structure

