doc.html

<div id="outline-container-mat_sig---apply-sigmoid-activation" class="outline-4">
<h4 id="mat_sig---apply-sigmoid-activation"><span class="section-number-4">1.8.7.</span> 5. mat<sub>sig</sub>() - Apply Sigmoid Activation</h4>
<div class="outline-text-4" id="text-mat_sig---apply-sigmoid-activation">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #95a99f;">void</span> <span style="color: #96a6c8;">mat_sig</span>(<span style="color: #95a99f;">Mat</span> <span style="color: #f4f4ff;">m</span>)
{
    <span style="color: #ffdd33; font-weight: bold;">for</span>(<span style="color: #95a99f;">size_t</span> <span style="color: #f4f4ff;">i</span> = 0; i &lt; m.rows; ++i) {
        <span style="color: #ffdd33; font-weight: bold;">for</span>(<span style="color: #95a99f;">size_t</span> <span style="color: #f4f4ff;">j</span> = 0; j &lt; m.cols; ++j) {
            MAT_AT(m, i, j) = sigmoidf(MAT_AT(m, i, j));
        }
    }
}

<span style="color: #95a99f;">float</span> <span style="color: #96a6c8;">sigmoidf</span>(<span style="color: #95a99f;">float</span> <span style="color: #f4f4ff;">x</span>)
{
    <span style="color: #ffdd33; font-weight: bold;">return</span> 1.f / (1.f + expf(-x));
}
</pre>
</div>
</div>
</div>

<div id="outline-container-the-sigmoid-function-1" class="outline-4">
<h4 id="the-sigmoid-function-1"><span class="section-number-4">1.8.8.</span> The Sigmoid Function:</h4>
<div class="outline-text-4" id="text-the-sigmoid-function-1">
<pre class="example" id="orgac2bc3f">
σ(x) = 1 / (1 + e^(-x))
</pre>

<p>
<b>Properties:</b> - Output range: (0, 1) - Squashes any input to between 0
and 1 - Differentiable (important for backpropagation)
</p>

<p>
<b>Graph:</b>
</p>

<pre class="example" id="org87b15dd">
1 |            ________
  |          /
  |        /
  |      /
  |    /
0 |__/
  +------------------
   -∞       0       +∞
</pre>
</div>
</div>

<div id="outline-container-mat_sum---element-wise-addition" class="outline-4">
<h4 id="mat_sum---element-wise-addition"><span class="section-number-4">1.8.9.</span> 6. mat<sub>sum</sub>() - Element-wise Addition</h4>
<div class="outline-text-4" id="text-mat_sum---element-wise-addition">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #95a99f;">void</span> <span style="color: #96a6c8;">mat_sum</span>(<span style="color: #95a99f;">Mat</span> <span style="color: #f4f4ff;">dst</span>, <span style="color: #95a99f;">Mat</span> <span style="color: #f4f4ff;">a</span>)
{
    NN_ASSERT(dst.rows == a.rows);
    NN_ASSERT(dst.cols == a.cols);
    <span style="color: #ffdd33; font-weight: bold;">for</span>(<span style="color: #95a99f;">size_t</span> <span style="color: #f4f4ff;">i</span> = 0; i &lt; dst.rows; ++i) {
        <span style="color: #ffdd33; font-weight: bold;">for</span>(<span style="color: #95a99f;">size_t</span> <span style="color: #f4f4ff;">j</span> = 0; j &lt; dst.cols; ++j) {
            MAT_AT(dst, i, j) += MAT_AT(a, i, j);
        }
    }
}
</pre>
</div>

<p>
Adds corresponding elements: <code>dst[i][j] +</code> a[i][j]=
</p>
</div>
</div>

<div id="outline-container-mat_copy---copy-matrix-data" class="outline-4">
<h4 id="mat_copy---copy-matrix-data"><span class="section-number-4">1.8.10.</span> 7. mat<sub>copy</sub>() - Copy Matrix Data</h4>
<div class="outline-text-4" id="text-mat_copy---copy-matrix-data">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #95a99f;">void</span> <span style="color: #96a6c8;">mat_copy</span>(<span style="color: #95a99f;">Mat</span> <span style="color: #f4f4ff;">dst</span>, <span style="color: #95a99f;">Mat</span> <span style="color: #f4f4ff;">src</span>)
{
    NN_ASSERT(dst.rows == src.rows);
    NN_ASSERT(dst.cols == src.cols);
    <span style="color: #ffdd33; font-weight: bold;">for</span>(<span style="color: #95a99f;">size_t</span> <span style="color: #f4f4ff;">i</span> = 0; i &lt; dst.rows; ++i) {
        <span style="color: #ffdd33; font-weight: bold;">for</span>(<span style="color: #95a99f;">size_t</span> <span style="color: #f4f4ff;">j</span> = 0; j &lt; dst.cols; ++j) {
            MAT_AT(dst, i, j) = MAT_AT(src, i, j);
        }
    }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-mat_rand---random-initialization" class="outline-4">
<h4 id="mat_rand---random-initialization"><span class="section-number-4">1.8.11.</span> 8. mat<sub>rand</sub>() - Random Initialization</h4>
<div class="outline-text-4" id="text-mat_rand---random-initialization">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #95a99f;">void</span> <span style="color: #96a6c8;">mat_rand</span>(<span style="color: #95a99f;">Mat</span> <span style="color: #f4f4ff;">m</span>, <span style="color: #95a99f;">float</span> <span style="color: #f4f4ff;">low</span>, <span style="color: #95a99f;">float</span> <span style="color: #f4f4ff;">high</span>)
{
    <span style="color: #ffdd33; font-weight: bold;">for</span>(<span style="color: #95a99f;">size_t</span> <span style="color: #f4f4ff;">i</span> = 0; i &lt; m.rows; ++i) {
        <span style="color: #ffdd33; font-weight: bold;">for</span>(<span style="color: #95a99f;">size_t</span> <span style="color: #f4f4ff;">j</span> = 0; j &lt; m.cols; ++j) {
            MAT_AT(m, i, j) = rand_float() * (high - low) + low;
        }
    }
}

<span style="color: #95a99f;">float</span> <span style="color: #96a6c8;">rand_float</span>(<span style="color: #95a99f;">void</span>)
{
    <span style="color: #ffdd33; font-weight: bold;">return</span> (<span style="color: #95a99f;">float</span>)rand()/(<span style="color: #95a99f;">float</span>)RAND_MAX;
}
</pre>
</div>

<p>
Generates random floats in range [low, high].
</p>
</div>
</div>

<div id="outline-container-mat_save-and-mat_load---persistence" class="outline-4">
<h4 id="mat_save-and-mat_load---persistence"><span class="section-number-4">1.8.12.</span> 9. mat<sub>save</sub>() and mat<sub>load</sub>() - Persistence</h4>
<div class="outline-text-4" id="text-mat_save-and-mat_load---persistence">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #95a99f;">void</span> <span style="color: #96a6c8;">mat_save</span>(<span style="color: #95a99f;">FILE</span> *<span style="color: #f4f4ff;">out</span>, <span style="color: #95a99f;">Mat</span> <span style="color: #f4f4ff;">m</span>)
{
    <span style="color: #ffdd33; font-weight: bold;">const</span> <span style="color: #95a99f;">char</span> *<span style="color: #f4f4ff;">magic</span> = <span style="color: #73c936;">"nn.h.mat"</span>;
    fwrite(magic, strlen(magic), 1, out);
    fwrite(&amp;m.rows, <span style="color: #ffdd33; font-weight: bold;">sizeof</span>(m.rows), 1, out);
    fwrite(&amp;m.cols, <span style="color: #ffdd33; font-weight: bold;">sizeof</span>(m.cols), 1, out);
    <span style="color: #ffdd33; font-weight: bold;">for</span>(<span style="color: #95a99f;">size_t</span> <span style="color: #f4f4ff;">i</span> = 0; i &lt; m.rows; ++i) {
        <span style="color: #95a99f;">size_t</span> <span style="color: #f4f4ff;">n</span> = fwrite(&amp;MAT_AT(m, i, 0), <span style="color: #ffdd33; font-weight: bold;">sizeof</span>(*m.es), m.cols, out);
        <span style="color: #ffdd33; font-weight: bold;">while</span>(n &lt; m.cols &amp;&amp; !ferror(out)) {
            <span style="color: #95a99f;">size_t</span> <span style="color: #f4f4ff;">k</span> = fwrite(m.es + n, <span style="color: #ffdd33; font-weight: bold;">sizeof</span>(*m.es), m.cols - n, out);
            n += k;
        }
    }
}
</pre>
</div>

<p>
Saves matrix to file with magic number for validation.
</p>
</div>
</div>

<div id="outline-container-mat_print---debug-output" class="outline-4">
<h4 id="mat_print---debug-output"><span class="section-number-4">1.8.13.</span> 10. mat<sub>print</sub>() - Debug Output</h4>
<div class="outline-text-4" id="text-mat_print---debug-output">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #95a99f;">void</span> <span style="color: #96a6c8;">mat_print</span>(<span style="color: #95a99f;">Mat</span> <span style="color: #f4f4ff;">m</span>, <span style="color: #ffdd33; font-weight: bold;">const</span> <span style="color: #95a99f;">char</span> *<span style="color: #f4f4ff;">name</span>, <span style="color: #95a99f;">size_t</span> <span style="color: #f4f4ff;">padding</span>)
{
    printf(<span style="color: #73c936;">"%*s%s = [\n"</span>,(<span style="color: #95a99f;">int</span>)padding, <span style="color: #73c936;">""</span>, name);
    <span style="color: #ffdd33; font-weight: bold;">for</span>(<span style="color: #95a99f;">size_t</span> <span style="color: #f4f4ff;">i</span> = 0; i &lt; m.rows; ++i) {
        printf(<span style="color: #73c936;">"%*s    "</span>, (<span style="color: #95a99f;">int</span>)padding, <span style="color: #73c936;">""</span>);
        <span style="color: #ffdd33; font-weight: bold;">for</span>(<span style="color: #95a99f;">size_t</span> <span style="color: #f4f4ff;">j</span> = 0; j &lt; m.cols; ++j) {
            printf(<span style="color: #73c936;">"%f "</span>, MAT_AT(m, i, j));
        }
        printf(<span style="color: #73c936;">"\n"</span>);
    }
    printf(<span style="color: #73c936;">"%*s]\n"</span>, (<span style="color: #95a99f;">int</span>)padding, <span style="color: #73c936;">""</span>);
}

<span style="color: #95a99f;">#define</span> <span style="color: #96a6c8;">MAT_PRINT</span>(<span style="color: #f4f4ff;">m</span>) mat_print(m, #m, 0)
</pre>
</div>

<p>
The <code>MAT_PRINT</code> macro uses stringification (<code>#m</code>) to automatically use
the variable name as the label.
</p>
</div>
</div>

<div id="outline-container-mat_shuffle_rows---random-row-shuffling" class="outline-4">
<h4 id="mat_shuffle_rows---random-row-shuffling"><span class="section-number-4">1.8.14.</span> 11. mat<sub>shuffle</sub><sub>rows</sub>() - Random Row Shuffling</h4>
<div class="outline-text-4" id="text-mat_shuffle_rows---random-row-shuffling">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #95a99f;">void</span> <span style="color: #96a6c8;">mat_shuffle_rows</span>(<span style="color: #95a99f;">Mat</span> <span style="color: #f4f4ff;">m</span>)
{
    <span style="color: #ffdd33; font-weight: bold;">for</span>(<span style="color: #95a99f;">size_t</span> <span style="color: #f4f4ff;">i</span> = 0; i &lt; m.rows; ++i) {
        <span style="color: #95a99f;">size_t</span> <span style="color: #f4f4ff;">j</span> = i + rand() % (m.rows - i);
        <span style="color: #ffdd33; font-weight: bold;">if</span>(i != j) {
            <span style="color: #ffdd33; font-weight: bold;">for</span>(<span style="color: #95a99f;">size_t</span> <span style="color: #f4f4ff;">k</span> = 0; k &lt; m.cols; ++k) {
                <span style="color: #95a99f;">float</span> <span style="color: #f4f4ff;">t</span> = MAT_AT(m, i, k);
                MAT_AT(m, i, k) = MAT_AT(m, j, k);
                MAT_AT(m, j, k) = t;
            }
        }
    }
}
</pre>
</div>

<p>
Uses Fisher-Yates shuffle algorithm for randomness. Important for
training to avoid order bias.
</p>

<hr />
</div>
</div>
</div>
