doc.org
** The NN Structure

#+BEGIN_SRC c
typedef struct {
    size_t count;    // Number of layers (input layer not counted)
    Mat *ws;         // Array of weight matrices
    Mat *bs;         // Array of bias matrices
    Mat *as;         // Array of activation matrices
} NN;
#+END_SRC

*** Understanding the Structure:

For a network with architecture =[2, 3, 1]= (2 inputs, 3 hidden, 1 output):
- =count = 2= (two layers with learnable parameters)
- =ws[0]= = 2×3 matrix (input → hidden weights)
- =bs[0]= = 1×3 matrix (hidden layer biases)
- =ws[1]= = 3×1 matrix (hidden → output weights)
- =bs[1]= = 1×1 matrix (output bias)
- =as[0]= = 1×2 matrix (input layer)
- =as[1]= = 1×3 matrix (hidden activations)
- =as[2]= = 1×1 matrix (output activations)

** Helper Macros

#+BEGIN_SRC c
#define NN_INPUT(nn) (nn).as[0]
#define NN_OUTPUT(nn) (nn).as[(nn).count]
#+END_SRC

These provide convenient access to input and output layers.

** nn_alloc() - Create Network

#+BEGIN_SRC c
NN nn_alloc(size_t *arch, size_t arch_count)
{
    NN_ASSERT(arch_count > 0);
    NN nn;
    nn.count = arch_count - 1;  // Number of weight layers

    nn.ws = NN_MALLOC(sizeof(*nn.ws)*nn.count);
    nn.bs = NN_MALLOC(sizeof(*nn.bs)*nn.count);
    nn.as = NN_MALLOC(sizeof(*nn.as)*(nn.count + 1));

    nn.as[0] = mat_alloc(1, arch[0]);  // Input layer

    for(size_t i = 1; i < arch_count; ++i) {
        nn.ws[i-1] = mat_alloc(nn.as[i-1].cols, arch[i]);
        nn.bs[i-1] = mat_alloc(nn.as[i-1].rows, arch[i]);
        nn.as[i]   = mat_alloc(nn.as[i-1].rows, arch[i]);
    }

    return nn;
}
#+END_SRC

** How it works:
1. Calculate number of layers with parameters
2. Allocate arrays for weights, biases, activations
3. Create each layer with appropriate dimensions

** nn_forward() - Forward Pass

#+BEGIN_SRC c
void nn_forward(NN nn)
{
    for(size_t i = 0; i < nn.count; ++i) {
        mat_dot(nn.as[i+1], nn.as[i], nn.ws[i]);  // Multiply by weights
        mat_sum(nn.as[i+1], nn.bs[i]);             // Add bias
        mat_sig(nn.as[i+1]);                       // Apply activation
    }
}
#+END_SRC

*** The Forward Pass:

For each layer:
1. *Weighted sum*: =y = a_prev × W=
2. *Add bias*: =y = y + b=
3. *Activation*: =a = σ(y)=

*Mathematical representation:*
#+BEGIN_EXAMPLE
a^(l) = σ(a^(l-1) × W^(l) + b^(l))
#+END_EXAMPLE

** nn_cost() - Calculate Loss

#+BEGIN_SRC c
float nn_cost(NN nn, Mat ti, Mat to)
{
    NN_ASSERT(ti.rows == to.rows);
    NN_ASSERT(to.cols == NN_OUTPUT(nn).cols);

    size_t n = ti.rows;
    float c = 0;

    for(size_t i = 0; i < n; ++i) {
        Mat x = mat_row(ti, i);  // Input sample
        Mat y = mat_row(to, i);  // Target output

        mat_copy(NN_INPUT(nn), x);
        nn_forward(nn);

        size_t q = to.cols;
        for(size_t j = 0; j < q; ++j) {
            float d = MAT_AT(NN_OUTPUT(nn), 0, j) - MAT_AT(y, 0, j);
            c += d*d;  // Squared error
        }
    }
    return c / n;  // Mean squared error
}
#+END_SRC

*** Understanding Cost Function:

*Mean Squared Error (MSE):*
#+BEGIN_EXAMPLE
J = (1/n) × Σ(predicted - actual)²
#+END_EXAMPLE

This measures how wrong the network's predictions are. Lower is better!

-----

* Training Algorithm

