doc.html

<div id="outline-container-neural-network-structure" class="outline-3">
<h3 id="neural-network-structure"><span class="section-number-3">1.9.</span> Neural Network Structure</h3>
<div class="outline-text-3" id="text-neural-network-structure">
</div>
<div id="outline-container-the-nn-structure" class="outline-4">
<h4 id="the-nn-structure"><span class="section-number-4">1.9.1.</span> The NN Structure</h4>
<div class="outline-text-4" id="text-the-nn-structure">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #ffdd33; font-weight: bold;">typedef</span> <span style="color: #ffdd33; font-weight: bold;">struct</span> {
    <span style="color: #95a99f;">size_t</span> <span style="color: #f4f4ff;">count</span>;    <span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">Number of layers (input layer not counted)
</span>    <span style="color: #95a99f;">Mat</span> *<span style="color: #f4f4ff;">ws</span>;         <span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">Array of weight matrices
</span>    <span style="color: #95a99f;">Mat</span> *<span style="color: #f4f4ff;">bs</span>;         <span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">Array of bias matrices
</span>    <span style="color: #95a99f;">Mat</span> *<span style="color: #f4f4ff;">as</span>;         <span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">Array of activation matrices
</span>} <span style="color: #95a99f;">NN</span>;
</pre>
</div>
</div>
</div>

<div id="outline-container-understanding-the-structure" class="outline-4">
<h4 id="understanding-the-structure"><span class="section-number-4">1.9.2.</span> Understanding the Structure:</h4>
<div class="outline-text-4" id="text-understanding-the-structure">
<p>
For a network with architecture <code>[2, 3, 1]</code> (2 inputs, 3 hidden, 1
output): - <code>count = 2</code> (two layers with learnable parameters) - <code>ws[0]</code>
= 2×3 matrix (input → hidden weights) - <code>bs[0]</code> = 1×3 matrix (hidden
layer biases) - <code>ws[1]</code> = 3×1 matrix (hidden → output weights) - <code>bs[1]</code>
= 1×1 matrix (output bias) - <code>as[0]</code> = 1×2 matrix (input layer) -
<code>as[1]</code> = 1×3 matrix (hidden activations) - <code>as[2]</code> = 1×1 matrix (output
activations)
</p>
</div>
</div>

<div id="outline-container-helper-macros" class="outline-4">
<h4 id="helper-macros"><span class="section-number-4">1.9.3.</span> Helper Macros</h4>
<div class="outline-text-4" id="text-helper-macros">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #95a99f;">#define</span> <span style="color: #96a6c8;">NN_INPUT</span>(<span style="color: #f4f4ff;">nn</span>) (nn).as[0]
<span style="color: #95a99f;">#define</span> <span style="color: #96a6c8;">NN_OUTPUT</span>(<span style="color: #f4f4ff;">nn</span>) (nn).as[(nn).count]
</pre>
</div>

<p>
These provide convenient access to input and output layers.
</p>
</div>
</div>

<div id="outline-container-nn_alloc---create-network" class="outline-4">
<h4 id="nn_alloc---create-network"><span class="section-number-4">1.9.4.</span> nn<sub>alloc</sub>() - Create Network</h4>
<div class="outline-text-4" id="text-nn_alloc---create-network">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #95a99f;">NN</span> <span style="color: #96a6c8;">nn_alloc</span>(<span style="color: #95a99f;">size_t</span> *<span style="color: #f4f4ff;">arch</span>, <span style="color: #95a99f;">size_t</span> <span style="color: #f4f4ff;">arch_count</span>)
{
    NN_ASSERT(arch_count &gt; 0);
    <span style="color: #95a99f;">NN</span> <span style="color: #f4f4ff;">nn</span>;
    nn.count = arch_count - 1;  <span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">Number of weight layers
</span>
    nn.ws = NN_MALLOC(<span style="color: #ffdd33; font-weight: bold;">sizeof</span>(*nn.ws)*nn.count);
    nn.bs = NN_MALLOC(<span style="color: #ffdd33; font-weight: bold;">sizeof</span>(*nn.bs)*nn.count);
    nn.as = NN_MALLOC(<span style="color: #ffdd33; font-weight: bold;">sizeof</span>(*nn.as)*(nn.count + 1));

    nn.as[0] = mat_alloc(1, arch[0]);  <span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">Input layer
</span>
    <span style="color: #ffdd33; font-weight: bold;">for</span>(<span style="color: #95a99f;">size_t</span> <span style="color: #f4f4ff;">i</span> = 1; i &lt; arch_count; ++i) {
        nn.ws[i-1] = mat_alloc(nn.as[i-1].cols, arch[i]);
        nn.bs[i-1] = mat_alloc(nn.as[i-1].rows, arch[i]);
        nn.as[i]   = mat_alloc(nn.as[i-1].rows, arch[i]);
    }

    <span style="color: #ffdd33; font-weight: bold;">return</span> nn;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-how-it-works" class="outline-4">
<h4 id="how-it-works"><span class="section-number-4">1.9.5.</span> How it works:</h4>
<div class="outline-text-4" id="text-how-it-works">
<ol class="org-ol">
<li>Calculate number of layers with parameters</li>
<li>Allocate arrays for weights, biases, activations</li>
<li>Create each layer with appropriate dimensions</li>
</ol>
</div>
</div>

<div id="outline-container-nn_forward---forward-pass" class="outline-4">
<h4 id="nn_forward---forward-pass"><span class="section-number-4">1.9.6.</span> nn<sub>forward</sub>() - Forward Pass</h4>
<div class="outline-text-4" id="text-nn_forward---forward-pass">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #95a99f;">void</span> <span style="color: #96a6c8;">nn_forward</span>(<span style="color: #95a99f;">NN</span> <span style="color: #f4f4ff;">nn</span>)
{
    <span style="color: #ffdd33; font-weight: bold;">for</span>(<span style="color: #95a99f;">size_t</span> <span style="color: #f4f4ff;">i</span> = 0; i &lt; nn.count; ++i) {
        mat_dot(nn.as[i+1], nn.as[i], nn.ws[i]);  <span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">Multiply by weights
</span>        mat_sum(nn.as[i+1], nn.bs[i]);             <span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">Add bias
</span>        mat_sig(nn.as[i+1]);                       <span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">Apply activation
</span>    }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-the-forward-pass" class="outline-4">
<h4 id="the-forward-pass"><span class="section-number-4">1.9.7.</span> The Forward Pass:</h4>
<div class="outline-text-4" id="text-the-forward-pass">
<p>
For each layer: 1. <b>Weighted sum</b>: <code>y = a_prev × W</code> 2. <b>Add bias</b>:
<code>y = y + b</code> 3. <b>Activation</b>: <code>a = σ(y)</code>
</p>

<p>
<b>Mathematical representation:</b>
</p>

<pre class="example" id="orgcdd7472">
a^(l) = σ(a^(l-1) × W^(l) + b^(l))
</pre>
</div>
</div>

<div id="outline-container-nn_cost---calculate-loss" class="outline-4">
<h4 id="nn_cost---calculate-loss"><span class="section-number-4">1.9.8.</span> nn<sub>cost</sub>() - Calculate Loss</h4>
<div class="outline-text-4" id="text-nn_cost---calculate-loss">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #95a99f;">float</span> <span style="color: #96a6c8;">nn_cost</span>(<span style="color: #95a99f;">NN</span> <span style="color: #f4f4ff;">nn</span>, <span style="color: #95a99f;">Mat</span> <span style="color: #f4f4ff;">ti</span>, <span style="color: #95a99f;">Mat</span> <span style="color: #f4f4ff;">to</span>)
{
    NN_ASSERT(ti.rows == to.rows);
    NN_ASSERT(to.cols == NN_OUTPUT(nn).cols);

    <span style="color: #95a99f;">size_t</span> <span style="color: #f4f4ff;">n</span> = ti.rows;
    <span style="color: #95a99f;">float</span> <span style="color: #f4f4ff;">c</span> = 0;

    <span style="color: #ffdd33; font-weight: bold;">for</span>(<span style="color: #95a99f;">size_t</span> <span style="color: #f4f4ff;">i</span> = 0; i &lt; n; ++i) {
        <span style="color: #95a99f;">Mat</span> <span style="color: #f4f4ff;">x</span> = mat_row(ti, i);  <span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">Input sample
</span>        <span style="color: #95a99f;">Mat</span> <span style="color: #f4f4ff;">y</span> = mat_row(to, i);  <span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">Target output
</span>
        mat_copy(NN_INPUT(nn), x);
        nn_forward(nn);

        <span style="color: #95a99f;">size_t</span> <span style="color: #f4f4ff;">q</span> = to.cols;
        <span style="color: #ffdd33; font-weight: bold;">for</span>(<span style="color: #95a99f;">size_t</span> <span style="color: #f4f4ff;">j</span> = 0; j &lt; q; ++j) {
            <span style="color: #95a99f;">float</span> <span style="color: #f4f4ff;">d</span> = MAT_AT(NN_OUTPUT(nn), 0, j) - MAT_AT(y, 0, j);
            c += d*d;  <span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">Squared error
</span>        }
    }
    <span style="color: #ffdd33; font-weight: bold;">return</span> c / n;  <span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">Mean squared error
</span>}
</pre>
</div>
</div>
</div>

<div id="outline-container-understanding-cost-function" class="outline-4">
<h4 id="understanding-cost-function"><span class="section-number-4">1.9.9.</span> Understanding Cost Function:</h4>
<div class="outline-text-4" id="text-understanding-cost-function">
<p>
<b>Mean Squared Error (MSE):</b>
</p>

<pre class="example" id="org7065301">
J = (1/n) × Σ(predicted - actual)²
</pre>

<p>
This measures how wrong the network's predictions are. Lower is better!
</p>

<hr />
</div>
</div>
</div>
