doc.org
* Common Pitfalls & Debugging Tips

** ⚠️ Common Mistakes Beginners Make

*** 1. Confusing Row-Major vs Column-Major Order
#+BEGIN_SRC c
// WRONG (column-major):
index = j * rows + i

// CORRECT (row-major):
index = i * cols + j
#+END_SRC
*Remember:* C uses row-major order!

*** 2. Forgetting to Initialize stride
#+BEGIN_SRC c
// WRONG:
Mat m = mat_alloc(2, 3);
m.stride = 2;  // Bug! Should be 3

// CORRECT:
Mat m = mat_alloc(2, 3);
// stride is already set to cols in mat_alloc
#+END_SRC

*** 3. Not Checking Matrix Dimensions Before Operations
#+BEGIN_SRC c
// Always assert dimensions match!
void mat_sum(Mat dst, Mat a)
{
    NN_ASSERT(dst.rows == a.rows);  // Don't forget this!
    NN_ASSERT(dst.cols == a.cols);
    // ... rest of function
}
#+END_SRC

*** 4. Modifying Row Views Affects Parent Matrix
#+BEGIN_SRC c
Mat row = mat_row(parent, 0);
MAT_AT(row, 0, 0) = 999;  // This changes parent!
#+END_SRC
*Remember:* Row views share memory with the parent!

*** 5. Learning Rate Too High or Too Low
#+BEGIN_SRC c
// Too high - training diverges:
float rate = 10.0f;

// Too low - training is very slow:
float rate = 0.00001f;

// Good starting point:
float rate = 0.1f;
#+END_SRC

*** 6. Forgetting to Seed Random Number Generator
#+BEGIN_SRC c
// WRONG - same "random" values every time:
nn_rand(nn, -1, 1);

// CORRECT:
srand(time(NULL));  // Seed once at program start
nn_rand(nn, -1, 1);
#+END_SRC

** 🔍 Debugging Techniques

*** Print Matrix Contents
#+BEGIN_SRC c
#define MAT_PRINT(m) mat_print(m, #m, 0)

// Use liberally during development!
MAT_PRINT(my_matrix);
#+END_SRC

*** Check for NaN or Infinity
#+BEGIN_SRC c
#include <math.h>

if (isnan(value) || isinf(value)) {
    printf("Found invalid value!\n");
}
#+END_SRC

*** Verify Gradients with Finite Differences
The =nn_finite_diff()= function can verify your backpropagation:
#+BEGIN_SRC c
NN nn = nn_alloc(arch, ARRAY_LEN(arch));
NN g = nn_alloc(arch, ARRAY_LEN(arch));
NN g2 = nn_alloc(arch, ARRAY_LEN(arch));

// Compare backprop with numerical gradient
nn_backprop(nn, g, ti, to);
nn_finite_diff(nn, g2, 0.001f, ti, to);

// g and g2 should be similar!
#+END_SRC

*** Track Cost During Training
#+BEGIN_SRC c
for (size_t i = 0; i < 10000; ++i) {
    nn_backprop(nn, g, ti, to);
    nn_learn(nn, g, rate);

    if (i % 100 == 0) {
        float cost = nn_cost(nn, ti, to);
        printf("Epoch %zu: Cost = %f\n", i, cost);

        // Cost should decrease over time!
        // If it increases, something is wrong.
    }
}
#+END_SRC

-----

* Key Takeaways

1. *Matrix operations* are the foundation of neural network computations
2. *Forward pass* computes predictions: =a = σ(a × W + b)=
3. *Backpropagation* computes gradients using the chain rule
4. *Gradient descent* updates weights: =W = W - α × ∇J=
5. *Cost function* measures prediction error (MSE)
6. *Sigmoid activation* squashes values to (0,1) range
7. *Batch training* processes multiple samples before updating
8. *Visualization* helps understand network behavior

-----

* Practice Problems

Test your understanding with these exercises:

** 📝 Beginner Problems

