doc.html

<div id="outline-container-common-pitfalls-debugging-tips" class="outline-3">
<h3 id="common-pitfalls-debugging-tips"><span class="section-number-3">1.14.</span> Common Pitfalls &amp; Debugging Tips</h3>
<div class="outline-text-3" id="text-common-pitfalls-debugging-tips">
</div>
<div id="outline-container-common-mistakes-beginners-make" class="outline-4">
<h4 id="common-mistakes-beginners-make"><span class="section-number-4">1.14.1.</span> ⚠️ Common Mistakes Beginners Make</h4>
<div class="outline-text-4" id="text-common-mistakes-beginners-make">
</div>
<ol class="org-ol">
<li><a id="confusing-row-major-vs-column-major-order"></a>1. Confusing Row-Major vs Column-Major Order<br />
<div class="outline-text-5" id="text-confusing-row-major-vs-column-major-order">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">WRONG (column-major):
</span>index = j * rows + i

<span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">CORRECT (row-major):
</span>index = i * cols + j
</pre>
</div>

<p>
<b>Remember:</b> C uses row-major order!
</p>
</div>
</li>

<li><a id="forgetting-to-initialize-stride"></a>2. Forgetting to Initialize stride<br />
<div class="outline-text-5" id="text-forgetting-to-initialize-stride">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">WRONG:
</span><span style="color: #95a99f;">Mat</span> <span style="color: #f4f4ff;">m</span> = mat_alloc(2, 3);
m.stride = 2;  <span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">Bug! Should be 3
</span>
<span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">CORRECT:
</span><span style="color: #95a99f;">Mat</span> <span style="color: #f4f4ff;">m</span> = mat_alloc(2, 3);
<span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">stride is already set to cols in mat_alloc</span>
</pre>
</div>
</div>
</li>

<li><a id="not-checking-matrix-dimensions-before-operations"></a>3. Not Checking Matrix Dimensions Before Operations<br />
<div class="outline-text-5" id="text-not-checking-matrix-dimensions-before-operations">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">Always assert dimensions match!
</span><span style="color: #95a99f;">void</span> <span style="color: #96a6c8;">mat_sum</span>(<span style="color: #95a99f;">Mat</span> <span style="color: #f4f4ff;">dst</span>, <span style="color: #95a99f;">Mat</span> <span style="color: #f4f4ff;">a</span>)
{
    NN_ASSERT(dst.rows == a.rows);  <span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">Don't forget this!
</span>    NN_ASSERT(dst.cols == a.cols);
    <span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">... rest of function
</span>}
</pre>
</div>
</div>
</li>

<li><a id="modifying-row-views-affects-parent-matrix"></a>4. Modifying Row Views Affects Parent Matrix<br />
<div class="outline-text-5" id="text-modifying-row-views-affects-parent-matrix">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #95a99f;">Mat</span> <span style="color: #f4f4ff;">row</span> = mat_row(parent, 0);
<span style="color: #96a6c8;">MAT_AT</span>(row, 0, 0) = 999;  <span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">This changes parent!</span>
</pre>
</div>

<p>
<b>Remember:</b> Row views share memory with the parent!
</p>
</div>
</li>

<li><a id="learning-rate-too-high-or-too-low"></a>5. Learning Rate Too High or Too Low<br />
<div class="outline-text-5" id="text-learning-rate-too-high-or-too-low">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">Too high - training diverges:
</span><span style="color: #95a99f;">float</span> <span style="color: #f4f4ff;">rate</span> = 10.0f;

<span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">Too low - training is very slow:
</span><span style="color: #95a99f;">float</span> <span style="color: #f4f4ff;">rate</span> = 0.00001f;

<span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">Good starting point:
</span><span style="color: #95a99f;">float</span> <span style="color: #f4f4ff;">rate</span> = 0.1f;
</pre>
</div>
</div>
</li>

<li><a id="forgetting-to-seed-random-number-generator"></a>6. Forgetting to Seed Random Number Generator<br />
<div class="outline-text-5" id="text-forgetting-to-seed-random-number-generator">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">WRONG - same "random" values every time:
</span><span style="color: #96a6c8;">nn_rand</span>(nn, -1, 1);

<span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">CORRECT:
</span><span style="color: #96a6c8;">srand</span>(time(<span style="color: #95a99f;">NULL</span>));  <span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">Seed once at program start
</span><span style="color: #96a6c8;">nn_rand</span>(nn, -1, 1);
</pre>
</div>
</div>
</li>
</ol>
</div>

<div id="outline-container-debugging-techniques" class="outline-4">
<h4 id="debugging-techniques"><span class="section-number-4">1.14.2.</span> 🔍 Debugging Techniques</h4>
<div class="outline-text-4" id="text-debugging-techniques">
</div>
<ol class="org-ol">
<li><a id="print-matrix-contents"></a>Print Matrix Contents<br />
<div class="outline-text-5" id="text-print-matrix-contents">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #95a99f;">#define</span> <span style="color: #96a6c8;">MAT_PRINT</span>(<span style="color: #f4f4ff;">m</span>) mat_print(m, #m, 0)

<span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">Use liberally during development!
</span><span style="color: #96a6c8;">MAT_PRINT</span>(my_matrix);
</pre>
</div>
</div>
</li>

<li><a id="check-for-nan-or-infinity"></a>Check for NaN or Infinity<br />
<div class="outline-text-5" id="text-check-for-nan-or-infinity">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #95a99f;">#include</span> <span style="color: #73c936;">&lt;math.h&gt;</span>

<span style="color: #ffdd33; font-weight: bold;">if</span> (isnan(value) || isinf(value)) {
    printf(<span style="color: #73c936;">"Found invalid value!\n"</span>);
}
</pre>
</div>
</div>
</li>

<li><a id="verify-gradients-with-finite-differences"></a>Verify Gradients with Finite Differences<br />
<div class="outline-text-5" id="text-verify-gradients-with-finite-differences">
<p>
The <code>nn_finite_diff()</code> function can verify your backpropagation:
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #95a99f;">NN</span> <span style="color: #f4f4ff;">nn</span> = nn_alloc(arch, ARRAY_LEN(arch));
<span style="color: #95a99f;">NN</span> <span style="color: #f4f4ff;">g</span> = nn_alloc(arch, ARRAY_LEN(arch));
<span style="color: #95a99f;">NN</span> <span style="color: #f4f4ff;">g2</span> = nn_alloc(arch, ARRAY_LEN(arch));

<span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">Compare backprop with numerical gradient
</span><span style="color: #96a6c8;">nn_backprop</span>(nn, g, ti, to);
<span style="color: #96a6c8;">nn_finite_diff</span>(nn, g2, 0.001f, ti, to);

<span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">g and g2 should be similar!</span>
</pre>
</div>
</div>
</li>

<li><a id="track-cost-during-training"></a>Track Cost During Training<br />
<div class="outline-text-5" id="text-track-cost-during-training">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #ffdd33; font-weight: bold;">for</span> (<span style="color: #95a99f;">size_t</span> <span style="color: #f4f4ff;">i</span> = 0; i &lt; 10000; ++i) {
    nn_backprop(nn, g, ti, to);
    nn_learn(nn, g, rate);

    <span style="color: #ffdd33; font-weight: bold;">if</span> (i % 100 == 0) {
        <span style="color: #95a99f;">float</span> <span style="color: #f4f4ff;">cost</span> = nn_cost(nn, ti, to);
        printf(<span style="color: #73c936;">"Epoch %zu: Cost = %f\n"</span>, i, cost);

        <span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">Cost should decrease over time!
</span>        <span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">If it increases, something is wrong.
</span>    }
}
</pre>
</div>

<hr />
</div>
</li>
</ol>
</div>
</div>

<div id="outline-container-key-takeaways" class="outline-3">
<h3 id="key-takeaways"><span class="section-number-3">1.15.</span> Key Takeaways</h3>
<div class="outline-text-3" id="text-key-takeaways">
<ol class="org-ol">
<li><b>Matrix operations</b> are the foundation of neural network computations</li>
<li><b>Forward pass</b> computes predictions: <code>a = σ(a × W + b)</code></li>
<li><b>Backpropagation</b> computes gradients using the chain rule</li>
<li><b>Gradient descent</b> updates weights: <code>W = W - α × ∇J</code></li>
<li><b>Cost function</b> measures prediction error (MSE)</li>
<li><b>Sigmoid activation</b> squashes values to (0,1) range</li>
<li><b>Batch training</b> processes multiple samples before updating</li>
<li><b>Visualization</b> helps understand network behavior</li>
</ol>

<hr />
</div>
</div>

<div id="outline-container-practice-problems" class="outline-3">
<h3 id="practice-problems"><span class="section-number-3">1.16.</span> Practice Problems</h3>
<div class="outline-text-3" id="text-practice-problems">
<p>
Test your understanding with these exercises:
</p>
</div>

<div id="outline-container-beginner-problems" class="outline-4">
<h4 id="beginner-problems"><span class="section-number-4">1.16.1.</span> 📝 Beginner Problems</h4>
<div class="outline-text-4" id="text-beginner-problems">
</div>
<ol class="org-ol">
