doc.org
*** Problem 1: Matrix Transpose
Write a function that transposes a matrix (rows become columns):

#+BEGIN_SRC c
Mat mat_transpose(Mat m)
{
    // TODO: Return a new matrix that is the transpose of m
    // Hint: For a 2×3 matrix, return a 3×2 matrix
}
#+END_SRC

*Hint:* The result should have dimensions =m.cols × m.rows=.
Element =[i][j]= of the result = element =[j][i]= of the input.

*Solution:*

#+BEGIN_SRC c
Mat mat_transpose(Mat m)
{
    Mat result = mat_alloc(m.cols, m.rows);
    for (size_t i = 0; i < m.rows; ++i) {
        for (size_t j = 0; j < m.cols; ++j) {
            MAT_AT(result, j, i) = MAT_AT(m, i, j);
        }
    }
    return result;
}
#+END_SRC

*** Problem 2: Element-wise Multiply
Write a function that multiplies two matrices element-by-element:

#+BEGIN_SRC c
void mat_elem_mult(Mat dst, Mat a, Mat b)
{
    // TODO: dst[i][j] = a[i][j] * b[i][j]
}
#+END_SRC

*Solution:*

#+BEGIN_SRC c
void mat_elem_mult(Mat dst, Mat a, Mat b)
{
    NN_ASSERT(dst.rows == a.rows);
    NN_ASSERT(dst.cols == a.cols);
    NN_ASSERT(a.rows == b.rows);
    NN_ASSERT(a.cols == b.cols);

    for (size_t i = 0; i < dst.rows; ++i) {
        for (size_t j = 0; j < dst.cols; ++j) {
            MAT_AT(dst, i, j) = MAT_AT(a, i, j) * MAT_AT(b, i, j);
        }
    }
}
#+END_SRC

** 📝 Intermediate Problems

*** Problem 3: ReLU Activation
Implement the ReLU activation function and its derivative:

#+BEGIN_SRC c
// ReLU: max(0, x)
float reluf(float x)
{
    // TODO: Return x if x > 0, else return 0
}

void mat_relu(Mat m)
{
    // TODO: Apply ReLU to every element
}
#+END_SRC

*Solution:*

#+BEGIN_SRC c
float reluf(float x)
{
    return x > 0 ? x : 0;
}

void mat_relu(Mat m)
{
    for (size_t i = 0; i < m.rows; ++i) {
        for (size_t j = 0; j < m.cols; ++j) {
            MAT_AT(m, i, j) = reluf(MAT_AT(m, i, j));
        }
    }
}
#+END_SRC

*** Problem 4: Add a New Layer Function
Write a function that adds a new layer to an existing network:

#+BEGIN_SRC c
void nn_add_layer(NN *nn, size_t layer_size)
{
    // TODO: Resize the network and add a new layer
    // This is challenging! Requires reallocation.
}
#+END_SRC

*Hint:* You'll need to:
1. Reallocate the ws, bs, and as arrays
2. Create new matrices for the additional layer
3. Update nn->count

** 📝 Advanced Problems

*** Problem 5: Implement Momentum
Modify the learning rule to use momentum, which helps escape local minima:

#+BEGIN_SRC c
typedef struct {
    NN velocity;  // Stores velocity for each parameter
} MomentumOptimizer;

void nn_learn_momentum(NN nn, NN g, MomentumOptimizer *opt, float rate, float momentum)
{
    // TODO: Update parameters using momentum
    // velocity = momentum * velocity - rate * gradient
    // parameter = parameter + velocity
}
#+END_SRC

*** Problem 6: Implement Dropout
Add dropout regularization to prevent overfitting:

#+BEGIN_SRC c
void mat_dropout(Mat m, float rate, bool *mask)
{
    // TODO: Randomly set elements to 0 with probability = rate
    // Store which elements were dropped in mask
}
#+END_SRC

*** Problem 7: Save/Load Neural Network
Write functions to save and load entire neural networks:

#+BEGIN_SRC c
void nn_save(FILE *out, NN nn)
{
    // TODO: Save all weights, biases, and architecture
}

NN nn_load(FILE *in)
{
    // TODO: Load and reconstruct a neural network
}
#+END_SRC

-----

