doc.html
<li><a id="problem-1-matrix-transpose"></a>Problem 1: Matrix Transpose<br />
<div class="outline-text-5" id="text-problem-1-matrix-transpose">
<p>
Write a function that transposes a matrix (rows become columns):
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #95a99f;">Mat</span> <span style="color: #96a6c8;">mat_transpose</span>(<span style="color: #95a99f;">Mat</span> <span style="color: #f4f4ff;">m</span>)
{
    <span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">TODO: Return a new matrix that is the transpose of m
</span>    <span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">Hint: For a 2&#215;3 matrix, return a 3&#215;2 matrix
</span>}
</pre>
</div>

<div class="html" id="org78f2bbc">
<p>
&lt;details&gt;
</p>

</div>

<div class="html" id="org1829c8b">
<p>
&lt;summary&gt;
</p>

</div>

<p>
Click for hint
</p>

<div class="html" id="org96aad85">
<p>
&lt;/summary&gt;
</p>

</div>

<p>
The result should have dimensions <code>m.cols × m.rows</code>. Element <code>[i][j]</code> of
the result = element <code>[j][i]</code> of the input.
</p>

<div class="html" id="org1f3b5cf">
<p>
&lt;/details&gt;
</p>

</div>

<div class="html" id="org48dde5c">
<p>
&lt;details&gt;
</p>

</div>

<div class="html" id="org60e283c">
<p>
&lt;summary&gt;
</p>

</div>

<p>
Click for solution
</p>

<div class="html" id="org8331b10">
<p>
&lt;/summary&gt;
</p>

</div>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #95a99f;">Mat</span> <span style="color: #96a6c8;">mat_transpose</span>(<span style="color: #95a99f;">Mat</span> <span style="color: #f4f4ff;">m</span>)
{
    <span style="color: #95a99f;">Mat</span> <span style="color: #f4f4ff;">result</span> = mat_alloc(m.cols, m.rows);
    <span style="color: #ffdd33; font-weight: bold;">for</span> (<span style="color: #95a99f;">size_t</span> <span style="color: #f4f4ff;">i</span> = 0; i &lt; m.rows; ++i) {
        <span style="color: #ffdd33; font-weight: bold;">for</span> (<span style="color: #95a99f;">size_t</span> <span style="color: #f4f4ff;">j</span> = 0; j &lt; m.cols; ++j) {
            MAT_AT(result, j, i) = MAT_AT(m, i, j);
        }
    }
    <span style="color: #ffdd33; font-weight: bold;">return</span> result;
}
</pre>
</div>

<div class="html" id="org62dab72">
<p>
&lt;/details&gt;
</p>

</div>
</div>
</li>

<li><a id="problem-2-element-wise-multiply"></a>Problem 2: Element-wise Multiply<br />
<div class="outline-text-5" id="text-problem-2-element-wise-multiply">
<p>
Write a function that multiplies two matrices element-by-element:
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #95a99f;">void</span> <span style="color: #96a6c8;">mat_elem_mult</span>(<span style="color: #95a99f;">Mat</span> <span style="color: #f4f4ff;">dst</span>, <span style="color: #95a99f;">Mat</span> <span style="color: #f4f4ff;">a</span>, <span style="color: #95a99f;">Mat</span> <span style="color: #f4f4ff;">b</span>)
{
    <span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">TODO: dst[i][j] = a[i][j] * b[i][j]
</span>}
</pre>
</div>

<div class="html" id="org5a7e5e4">
<p>
&lt;details&gt;
</p>

</div>

<div class="html" id="org3483082">
<p>
&lt;summary&gt;
</p>

</div>

<p>
Click for solution
</p>

<div class="html" id="orgbf66f0f">
<p>
&lt;/summary&gt;
</p>

</div>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #95a99f;">void</span> <span style="color: #96a6c8;">mat_elem_mult</span>(<span style="color: #95a99f;">Mat</span> <span style="color: #f4f4ff;">dst</span>, <span style="color: #95a99f;">Mat</span> <span style="color: #f4f4ff;">a</span>, <span style="color: #95a99f;">Mat</span> <span style="color: #f4f4ff;">b</span>)
{
    NN_ASSERT(dst.rows == a.rows);
    NN_ASSERT(dst.cols == a.cols);
    NN_ASSERT(a.rows == b.rows);
    NN_ASSERT(a.cols == b.cols);

    <span style="color: #ffdd33; font-weight: bold;">for</span> (<span style="color: #95a99f;">size_t</span> <span style="color: #f4f4ff;">i</span> = 0; i &lt; dst.rows; ++i) {
        <span style="color: #ffdd33; font-weight: bold;">for</span> (<span style="color: #95a99f;">size_t</span> <span style="color: #f4f4ff;">j</span> = 0; j &lt; dst.cols; ++j) {
            MAT_AT(dst, i, j) = MAT_AT(a, i, j) * MAT_AT(b, i, j);
        }
    }
}
</pre>
</div>

<div class="html" id="orga0283bc">
<p>
&lt;/details&gt;
</p>

</div>
</div>
</li>
</ol>
</div>

<div id="outline-container-intermediate-problems" class="outline-4">
<h4 id="intermediate-problems"><span class="section-number-4">1.16.2.</span> 📝 Intermediate Problems</h4>
<div class="outline-text-4" id="text-intermediate-problems">
</div>
<ol class="org-ol">
<li><a id="problem-3-relu-activation"></a>Problem 3: ReLU Activation<br />
<div class="outline-text-5" id="text-problem-3-relu-activation">
<p>
Implement the ReLU activation function and its derivative:
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">ReLU: max(0, x)
</span><span style="color: #95a99f;">float</span> <span style="color: #96a6c8;">reluf</span>(<span style="color: #95a99f;">float</span> <span style="color: #f4f4ff;">x</span>)
{
    <span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">TODO: Return x if x &gt; 0, else return 0
</span>}

<span style="color: #95a99f;">void</span> <span style="color: #96a6c8;">mat_relu</span>(<span style="color: #95a99f;">Mat</span> <span style="color: #f4f4ff;">m</span>)
{
    <span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">TODO: Apply ReLU to every element
</span>}
</pre>
</div>

<div class="html" id="org1b457c2">
<p>
&lt;details&gt;
</p>

</div>

<div class="html" id="org15fbdfc">
<p>
&lt;summary&gt;
</p>

</div>

<p>
Click for solution
</p>

<div class="html" id="orgb02ee29">
<p>
&lt;/summary&gt;
</p>

</div>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #95a99f;">float</span> <span style="color: #96a6c8;">reluf</span>(<span style="color: #95a99f;">float</span> <span style="color: #f4f4ff;">x</span>)
{
    <span style="color: #ffdd33; font-weight: bold;">return</span> x &gt; 0 ? x : 0;
}

<span style="color: #95a99f;">void</span> <span style="color: #96a6c8;">mat_relu</span>(<span style="color: #95a99f;">Mat</span> <span style="color: #f4f4ff;">m</span>)
{
    <span style="color: #ffdd33; font-weight: bold;">for</span> (<span style="color: #95a99f;">size_t</span> <span style="color: #f4f4ff;">i</span> = 0; i &lt; m.rows; ++i) {
        <span style="color: #ffdd33; font-weight: bold;">for</span> (<span style="color: #95a99f;">size_t</span> <span style="color: #f4f4ff;">j</span> = 0; j &lt; m.cols; ++j) {
            MAT_AT(m, i, j) = reluf(MAT_AT(m, i, j));
        }
    }
}
</pre>
</div>

<div class="html" id="org9713e93">
<p>
&lt;/details&gt;
</p>

</div>
</div>
</li>

<li><a id="problem-4-add-a-new-layer-function"></a>Problem 4: Add a New Layer Function<br />
<div class="outline-text-5" id="text-problem-4-add-a-new-layer-function">
<p>
Write a function that adds a new layer to an existing network:
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #95a99f;">void</span> <span style="color: #96a6c8;">nn_add_layer</span>(<span style="color: #95a99f;">NN</span> *<span style="color: #f4f4ff;">nn</span>, <span style="color: #95a99f;">size_t</span> <span style="color: #f4f4ff;">layer_size</span>)
{
    <span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">TODO: Resize the network and add a new layer
</span>    <span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">This is challenging! Requires reallocation.
</span>}
</pre>
</div>

<div class="html" id="orgc217312">
<p>
&lt;details&gt;
</p>

</div>

<div class="html" id="org05340a1">
<p>
&lt;summary&gt;
</p>

</div>

<p>
Click for hint
</p>

<div class="html" id="org0a0e328">
<p>
&lt;/summary&gt;
</p>

</div>

<p>
You'll need to: 1. Reallocate the ws, bs, and as arrays 2. Create new
matrices for the additional layer 3. Update nn-&gt;count
</p>

<div class="html" id="org2512c47">
<p>
&lt;/details&gt;
</p>

</div>
</div>
</li>
</ol>
</div>

<div id="outline-container-advanced-problems" class="outline-4">
<h4 id="advanced-problems"><span class="section-number-4">1.16.3.</span> 📝 Advanced Problems</h4>
<div class="outline-text-4" id="text-advanced-problems">
</div>
<ol class="org-ol">
<li><a id="problem-5-implement-momentum"></a>Problem 5: Implement Momentum<br />
<div class="outline-text-5" id="text-problem-5-implement-momentum">
<p>
Modify the learning rule to use momentum, which helps escape local
minima:
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #ffdd33; font-weight: bold;">typedef</span> <span style="color: #ffdd33; font-weight: bold;">struct</span> {
    <span style="color: #95a99f;">NN</span> <span style="color: #f4f4ff;">velocity</span>;  <span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">Stores velocity for each parameter
</span>} <span style="color: #95a99f;">MomentumOptimizer</span>;

<span style="color: #95a99f;">void</span> <span style="color: #96a6c8;">nn_learn_momentum</span>(<span style="color: #95a99f;">NN</span> <span style="color: #f4f4ff;">nn</span>, <span style="color: #95a99f;">NN</span> <span style="color: #f4f4ff;">g</span>, <span style="color: #95a99f;">MomentumOptimizer</span> *<span style="color: #f4f4ff;">opt</span>, <span style="color: #95a99f;">float</span> <span style="color: #f4f4ff;">rate</span>, <span style="color: #95a99f;">float</span> <span style="color: #f4f4ff;">momentum</span>)
{
    <span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">TODO: Update parameters using momentum
</span>    <span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">velocity = momentum * velocity - rate * gradient
</span>    <span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">parameter = parameter + velocity
</span>}
</pre>
</div>
</div>
</li>

<li><a id="problem-6-implement-dropout"></a>Problem 6: Implement Dropout<br />
<div class="outline-text-5" id="text-problem-6-implement-dropout">
<p>
Add dropout regularization to prevent overfitting:
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #95a99f;">void</span> <span style="color: #96a6c8;">mat_dropout</span>(<span style="color: #95a99f;">Mat</span> <span style="color: #f4f4ff;">m</span>, <span style="color: #95a99f;">float</span> <span style="color: #f4f4ff;">rate</span>, <span style="color: #95a99f;">bool</span> *<span style="color: #f4f4ff;">mask</span>)
{
    <span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">TODO: Randomly set elements to 0 with probability = rate
</span>    <span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">Store which elements were dropped in mask
</span>}
</pre>
</div>
</div>
</li>

<li><a id="problem-7-saveload-neural-network"></a>Problem 7: Save/Load Neural Network<br />
<div class="outline-text-5" id="text-problem-7-saveload-neural-network">
<p>
Write functions to save and load entire neural networks:
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #95a99f;">void</span> <span style="color: #96a6c8;">nn_save</span>(<span style="color: #95a99f;">FILE</span> *<span style="color: #f4f4ff;">out</span>, <span style="color: #95a99f;">NN</span> <span style="color: #f4f4ff;">nn</span>)
{
    <span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">TODO: Save all weights, biases, and architecture
</span>}

<span style="color: #95a99f;">NN</span> <span style="color: #96a6c8;">nn_load</span>(<span style="color: #95a99f;">FILE</span> *<span style="color: #f4f4ff;">in</span>)
{
    <span style="color: #cc8c3c;">// </span><span style="color: #cc8c3c;">TODO: Load and reconstruct a neural network
</span>}
</pre>
</div>

<hr />
</div>
</li>
</ol>
</div>
</div>
