doc.html

<div id="outline-container-further-learning" class="outline-3">
<h3 id="further-learning"><span class="section-number-3">1.17.</span> Further Learning</h3>
<div class="outline-text-3" id="text-further-learning">
<ul class="org-ul">
<li><b>Matrix multiplication</b>: Essential for understanding neural networks</li>
<li><b>Calculus</b>: Derivatives and chain rule for backpropagation</li>
<li><b>Optimization</b>: Gradient descent variants (SGD, Adam, etc.)</li>
<li><b>Activation functions</b>: ReLU, tanh, softmax alternatives</li>
<li><b>Regularization</b>: L1/L2, dropout for preventing overfitting</li>
</ul>

<hr />
</div>
</div>

<div id="outline-container-summary-table" class="outline-3">
<h3 id="summary-table"><span class="section-number-3">1.18.</span> Summary Table</h3>
<div class="outline-text-3" id="text-summary-table">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Function</th>
<th scope="col" class="org-left">Purpose</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>mat_alloc</code></td>
<td class="org-left">Create a new matrix</td>
</tr>

<tr>
<td class="org-left"><code>mat_dot</code></td>
<td class="org-left">Matrix multiplication</td>
</tr>

<tr>
<td class="org-left"><code>mat_sum</code></td>
<td class="org-left">Element-wise addition</td>
</tr>

<tr>
<td class="org-left"><code>mat_sig</code></td>
<td class="org-left">Apply sigmoid activation</td>
</tr>

<tr>
<td class="org-left"><code>mat_fill</code></td>
<td class="org-left">Fill with constant value</td>
</tr>

<tr>
<td class="org-left"><code>mat_copy</code></td>
<td class="org-left">Copy matrix data</td>
</tr>

<tr>
<td class="org-left"><code>mat_rand</code></td>
<td class="org-left">Random initialization</td>
</tr>

<tr>
<td class="org-left"><code>mat_save</code></td>
<td class="org-left">Save to file</td>
</tr>

<tr>
<td class="org-left"><code>mat_load</code></td>
<td class="org-left">Load from file</td>
</tr>

<tr>
<td class="org-left"><code>nn_alloc</code></td>
<td class="org-left">Create neural network</td>
</tr>

<tr>
<td class="org-left"><code>nn_forward</code></td>
<td class="org-left">Compute predictions</td>
</tr>

<tr>
<td class="org-left"><code>nn_backprop</code></td>
<td class="org-left">Calculate gradients</td>
</tr>

<tr>
<td class="org-left"><code>nn_learn</code></td>
<td class="org-left">Update weights</td>
</tr>

<tr>
<td class="org-left"><code>nn_cost</code></td>
<td class="org-left">Compute error</td>
</tr>

<tr>
<td class="org-left"><code>nn_rand</code></td>
<td class="org-left">Randomize weights</td>
</tr>
</tbody>
</table>

<hr />
</div>
</div>

<div id="outline-container-references" class="outline-3">
<h3 id="references"><span class="section-number-3">1.19.</span> References</h3>
<div class="outline-text-3" id="text-references">
<ul class="org-ul">
<li><b>Neural Networks and Deep Learning</b> by Michael Nielsen</li>
<li><b>CS231n: Convolutional Neural Networks</b> (Stanford)</li>
<li><b>The Matrix Cookbook</b> (matrix reference)</li>
</ul>

<hr />

<p>
<i>This document provides a comprehensive explanation of the nn.h library,
designed for beginners learning neural network implementation in C.</i>
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: YFZX-WZX</p>
<p class="date">Created: 2026-03-11 Wed 16:26</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
